
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Перем ДополнительныеПараметры;
	Если Параметры.Свойство("ДополнительныеПараметры", ДополнительныеПараметры) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора    =   ПолучитьДанные(ДополнительныеПараметры.ВидыДичи);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанные(ВидыДичи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыДичи.Ссылка КАК ВидДичи,
		|	ВидыДичи.Представление КАК Представление
		|ИЗ
		|	Справочник.ВидыДичи КАК ВидыДичи
		|ГДЕ
		|	НЕ ВидыДичи.ПометкаУдаления
		|	И НЕ ВидыДичи.Ссылка В (&ВидыДичи)
		|	И НЕ ВидыДичи.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыДичи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ВидыДичи", ВидыДичи.ВыгрузитьКолонку("ВидДичи"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокДанных = Новый СписокЗначений;
		
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл

			СписокДанных.Добавить(Выборка.ВидДичи ,Выборка.Представление,Ложь);

		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокДанных;
	
КонецФункции
