Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОсновнаяОрганизация = ЭтотОбъект.ОсновнаяОрганизация;
	
	Если НЕ ОсновнаяОрганизация.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОхотхозяйствоПользователя",ОсновнаяОрганизация);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОхотхозяйствоПользователя")).Использование =Ложь;
	КонецЕсли;	
	
	Если НЕ ЭтотОбъект.Подробно Тогда
		Если ЭтотОбъект.ДобычаПо Тогда
			ИмяГруппировки = "ТМ";
		Иначе
			ИмяГруппировки = "ТО";
	КонецЕсли;	
	Иначе ИмяГруппировки = "П";
	КонецЕсли;
	
	Для Каждого ГруппировкаСКД Из КомпоновщикНастроек.Настройки.Структура Цикл
			ГруппировкаСКД.Использование = ?(ГруппировкаСКД.Имя = ИмяГруппировки, Истина, Ложь);
	КонецЦикла;
	
	ПериодОтчета = ЭтотОбъект.ПериодОтчета;
	Если ЗначениеЗаполнено(ПериодОтчета) Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",ПериодОтчета);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Использование =Ложь;
	КонецЕсли;	

	ОхотаСервер.ЗаполнитьЗаголовокОтчета(ЭтотОбъект);
КонецПроцедуры
