////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ИнтерактивноеСообщение(ПутьКРеквизиту,ТекстСообщения)
	
	СообщениеДляПользователя = Новый СообщениеПользователю();
	СообщениеДляПользователя.Текст = ТекстСообщения;
	СообщениеДляПользователя.Поле = ПутьКРеквизиту;
	СообщениеДляПользователя.УстановитьДанные(Объект);
	СообщениеДляПользователя.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Функция ТекущаяГруппа()
	
	Если Элементы.ТаблицаГрупп.ТекущиеДанные = Неопределено
		ИЛИ Элементы.ТаблицаГрупп.ТекущиеДанные.НомерГруппы = 0 Тогда
		ТекущаяГруппа = 0;		
	Иначе
		ТекущаяГруппа = Элементы.ТаблицаГрупп.ТекущиеДанные.НомерГруппы;
	КонецЕсли;
	
	Возврат ТекущаяГруппа;
		
КонецФункции // ()

&НаКлиенте
Функция УстановитьДоступностьВыполненияЗамены()
	
	Элементы.НайденныеОбъектыВыполнитьЗамену.Доступность = НайденныеОбъекты.НайтиСтроки(Новый Структура("Правильный",Истина)).Количество() > 0;
		
КонецФункции // ()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ ДАННЫХ

&НаСервере
Функция ПолучитьТекстЗапроса()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ОбъектПоиска.Ссылка КАК Объект
	        |ИЗ
	        |	Справочник."+ОбрабатываемыйСправочник.Имя+" КАК ОбъектПоиска";
			
КонецФункции

&НаСервере
Функция ОпределитьКоличествоЭлементовДляПоискаВСправочнике()
	
	Если НЕ ЗначениеЗаполнено(ОбрабатываемыйСправочник) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "Выбрать Количество(*) КАК Количество
	|ИЗ
	|	Справочник." + ОбрабатываемыйСправочник.Имя + " КАК _Таблица
	|";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Таблица.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Таблица[0].Количество;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбновитьПереченьРеквизитовИДополнительныйОтбор(ВыбранноеЗначение)
	
	РеквизитДляПоиска = "";
	ОбрабатываемыйРеквизит = "";
	РеквизитДляПоиска = "Наименование";
	ОбрабатываемыйРеквизит = "Наименование";
	
	РеквизитДляПоискаСписокЗначений.Очистить();
	
	Данные = Метаданные.Справочники[ВыбранноеЗначение.Имя];
	
	//добавляем стандартные реквизиты:
	Если Данные.Владельцы.Количество() > 0 Тогда
		РеквизитДляПоискаСписокЗначений.Добавить(Новый Структура("Имя,Представление","Владелец","Владелец"),"Владелец");
	КонецЕсли;
			
	Если Данные.ДлинаКода > 0 Тогда
		РеквизитДляПоискаСписокЗначений.Добавить(Новый Структура("Имя,Представление","Код","Код"),"Код");
	КонецЕсли;
			
	Если Данные.ДлинаНаименования > 0 Тогда
		РеквизитДляПоискаСписокЗначений.Добавить(Новый Структура("Имя,Представление","Наименование","Наименование"),"Наименование");
	КонецЕсли;
	
	//добавляем пользовательские реквизиты:
	Для каждого ВыбранныйРеквизит Из Данные.Реквизиты Цикл
		Синоним = ?(СокрЛП(ВыбранныйРеквизит.Синоним)="",ВыбранныйРеквизит.Имя,ВыбранныйРеквизит.Синоним);
		РеквизитДляПоискаСписокЗначений.Добавить(Новый Структура("Имя,Представление",ВыбранныйРеквизит.Имя,Синоним),Синоним);
	КонецЦикла;
	
	РеквизитДляПоискаСписокЗначений.СортироватьПоПредставлению();
	
	//обновляем дополнительный отбор:
	ДополнительныйОтбор.ЗагрузитьНастройки(Новый НастройкиКомпоновкиДанных);
	
	СхемаКомпоновки = ПолучитьСхемуКомпоновки(ПолучитьТекстЗапроса());		
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);	
		
	ДополнительныйОтбор.Инициализировать(ИсточникНастроек);
	
	РежимПоиска = 1;
	Элементы.РежимПоиска.Доступность = ОпределитьВозможностьУстановкиРежимаПоискаДляТекущийхДанных();
	Элементы.ДопустимоеРазличиеСлов.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСОтборами()
	
	ОтборДанных = ДополнительныйОтбор.ПолучитьНастройки();
	
	Запрос = Новый Запрос;
	
	СписокУсловий = "";
	Если ОтборДанных <> Неопределено Тогда
		Для Каждого ЭлементОтбора Из ОтборДанных.Отбор.Элементы Цикл
			Если НЕ ЭлементОтбора.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			Индекс = ОтборДанных.Отбор.Элементы.Индекс(ЭлементОтбора);
			ИмяПараметра = СтрЗаменить(Строка(ЭлементОтбора.ЛевоеЗначение) + Индекс, ".", "");
			
			СписокУсловий = СписокУсловий + ?(СписокУсловий = "", "", "
			|	И ") + ПолучитьВидСравнения("Спр1",ЭлементОтбора.ЛевоеЗначение, ЭлементОтбора.ВидСравнения, ИмяПараметра);
			
			Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СтандартнаяДатаНачала") Тогда
				Запрос.УстановитьПараметр(ИмяПараметра, ЭлементОтбора.ПравоеЗначение.Дата);
			Иначе
				Запрос.УстановитьПараметр(ИмяПараметра, ЭлементОтбора.ПравоеЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если РежимПоиска = 1 Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ Спр1.Ссылка КАК Ссылка,
		|Спр1." + ОбрабатываемыйРеквизит + " КАК ЗначениеРеквизита
		|Из Справочник." + ОбрабатываемыйСправочник.Имя  + " КАК Спр1, Справочник." + ОбрабатываемыйСправочник.Имя  + " КАК Спр2
		|ГДЕ Спр1." + ОбрабатываемыйРеквизит +  " = Спр2." + ОбрабатываемыйРеквизит +  " И Спр1.Ссылка <> Спр2.Ссылка" + ?(СписокУсловий <> "", " И " + СписокУсловий, "") + "
		|СГРУППИРОВАТЬ ПО Спр1.Ссылка";
	Иначе
		МетаданныеСправочника = Метаданные.Справочники[ОбрабатываемыйСправочник.Имя];	
		
		СтрокаУпорядочивания = МетаданныеСправочника.ВводПоСтроке;
		
		Если Не ПустаяСтрока(СтрокаУпорядочивания) Тогда
			
			СтрокаУпорядочивания = "УПОРЯДОЧИТЬ ПО " + СтрокаУпорядочивания;	
			
		КонецЕсли;
		
		Запрос.Текст = "
		|ВЫБРАТЬ Ссылка,
		|" + ОбрабатываемыйРеквизит + " КАК ЗначениеРеквизита 
		|Из Справочник." + ОбрабатываемыйСправочник.Имя + " КАК Спр1" + ?(СписокУсловий <> "", " ГДЕ " + СписокУсловий, "") + "
		|" + СтрокаУпорядочивания;
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьВидСравнения(ИмяТаблицы, ИмяПоля, ВидСравненияОтбора, ИмяПараметра)
	
	Если Лев(ИмяПоля, 7) = "Объект." Тогда
		ИмяПоля = "Ссылка." + Сред(ИмяПоля, 8);
	КонецЕсли;
	
    Если ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно  Тогда
		Возврат ИмяТаблицы + "." + ИмяПоля + " = &" + ИмяПараметра;
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Больше Тогда
		Возврат ИмяТаблицы + "." + ИмяПоля + " > &" + ИмяПараметра;
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.БольшеИлиРавно  Тогда
		Возврат ИмяТаблицы + "." + ИмяПоля + " >= &" + ИмяПараметра;
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВИерархии 
		ИЛИ  ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
		Возврат ИмяТаблицы + "." + ИмяПоля + " В ИЕРАРХИИ (&" + ИмяПараметра + ")";
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке  Тогда
		Возврат ИмяТаблицы + "." + ИмяПоля + " В (&" + ИмяПараметра + ")";
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Меньше  Тогда
		Возврат ИмяТаблицы + "." + ИмяПоля + " < &" + ИмяПараметра;
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно  Тогда         
		Возврат ИмяТаблицы + "." + ИмяПоля + " <= &" + ИмяПараметра;
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВСписке  Тогда
		Возврат "НЕ " + ИмяТаблицы + "." + ИмяПоля + " В (&" + ИмяПараметра + ")";
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВИерархии 
		ИЛИ ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		Возврат "НЕ " + ИмяТаблицы + "." + ИмяПоля + " В ИЕРАРХИИ (&" + ИмяПараметра + ")";
	ИначеЕсли ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеРавно  Тогда
		Возврат ИмяТаблицы + "." + ИмяПоля + " <> &" + ИмяПараметра;
	КонецЕсли; 

КонецФункции

&НаСервере
Процедура ДобавитьНовуюГруппу(ТекущаяГруппа, ЭлементовВГруппе, ЗначениеРеквизита)
	
	Если ТекущаяГруппа <> 0 Тогда
				
		СтрокаГрупп = ТаблицаГрупп.Добавить();
		СтрокаГрупп.НомерГруппы = ТекущаяГруппа;
		СтрокаГрупп.Количество = ЭлементовВГруппе;
		
		Если ЗначениеРеквизита <> Неопределено Тогда
			СтрокаГрупп.Группа = ЗначениеРеквизита;
		КонецЕсли;	
				
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура НайтиПоРавенствуРеквизитов()
	
	РезультатыПоиска.Загрузить(ПолучитьДанныеСОтборами());
	РезультатыПоиска.Сортировать("ЗначениеРеквизита");
	
	ТаблицаГрупп.Очистить();
	
	ЗначениеРеквизита = Неопределено;
	ТекущаяГруппа = 0;
	ЭлементовВГруппе = 0;
	Для Каждого СтрокаПоиска ИЗ РезультатыПоиска Цикл
		
		Если СтрокаПоиска.ЗначениеРеквизита <> ЗначениеРеквизита Тогда
			
			ДобавитьНовуюГруппу(ТекущаяГруппа, ЭлементовВГруппе, ЗначениеРеквизита);
							
			ЗначениеРеквизита = СтрокаПоиска.ЗначениеРеквизита;
			ТекущаяГруппа = ТекущаяГруппа + 1;
			ЭлементовВГруппе = 0;
			
		КонецЕсли;
		
		СтрокаПоиска.НомерГруппы = - ТекущаяГруппа;
		ЭлементовВГруппе = ЭлементовВГруппе + 1;
		
	КонецЦикла;
	
	ДобавитьНовуюГруппу(ТекущаяГруппа, ЭлементовВГруппе, ЗначениеРеквизита);
			
	ТаблицаГрупп.Сортировать("Количество");
	
	ТекущаяГруппа = 1;
	КолвоЭлементовКоллекции = ТаблицаГрупп.Количество();
	Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл
		ЭлементКоллекции = ТаблицаГрупп[КолвоЭлементовКоллекции - ОбратныйИндекс];
		
		МассивСтрок = РезультатыПоиска.НайтиСтроки(Новый Структура("НомерГруппы", -ЭлементКоллекции.НомерГруппы));
		
		Если ЭлементКоллекции.Количество = 1 Тогда
			
			Для каждого СтрокаГруппы ИЗ МассивСтрок Цикл
				РезультатыПоиска.Удалить(СтрокаГруппы);
			КонецЦикла;			
			ТаблицаГрупп.Удалить(ЭлементКоллекции);
			
		Иначе
			
			Для каждого СтрокаГруппы ИЗ МассивСтрок Цикл
				СтрокаГруппы.НомерГруппы = ТекущаяГруппа;
			КонецЦикла;
			ЭлементКоллекции.НомерГруппы = ТекущаяГруппа;
			ТекущаяГруппа = ТекущаяГруппа + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаГрупп.Сортировать("Группа");
		
	Если РезультатыПоиска.Количество() > 0 Тогда
		ВывестиГруппу(1);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ВывестиГруппу(НомерГруппы, ПроверятьСуществованиеОбъектов = Ложь)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Структура = Новый Структура("НомерГруппы", НомерГруппы);
	
	МассивСтрок = РезультатыПоиска.НайтиСтроки(Структура);
	
	НайденныеОбъекты.Очистить();
	
	Для Каждого Строка Из МассивСтрок Цикл
		Если ПроверятьСуществованиеОбъектов И НЕ ОбъектСуществует(Строка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = НайденныеОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.ЗначениеРеквизита = Строка(НоваяСтрока.Ссылка);
		Если ЗначениеЗаполнено(НоваяСтрока.Ссылка) Тогда
			НоваяСтрока.Код = НоваяСтрока.Ссылка.Код;
			НоваяСтрока.Значок = ?(НоваяСтрока.Ссылка.ПометкаУдаления,	Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ЭлементСправочникаПометкаНаУдаление"),Истина),
																		Новый Картинка(ОбработкаОбъект.ПолучитьМакет("ЭлементСправочника"),Истина));
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОбъектСуществует(СсылкаНаОбъект)
	
	Попытка
		ОбъектДанных = СсылкаНаОбъект.ПолучитьОбъект();
		Если ОбъектДанных = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОИСКА ДУБЛИКАТОВ ПО СОВПАДАЮЩИМ СЛОВАМ

&НаСервере
Функция НайтиПоСовпадающимСловам_ПолучитьЭлементыСправочника()
	
	Результат = Новый Массив;
	
	ТаблицаСправочника = ПолучитьДанныеСОтборами();
	Для каждого СтрокаСсылки ИЗ ТаблицаСправочника Цикл
		СтруктураСтроки = Новый Структура("Ссылка,ЗначениеРеквизита",СтрокаСсылки.Ссылка,СтрокаСсылки.ЗначениеРеквизита);
		Результат.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НайтиПоСовпадающимСловам_ПолучитьСтрокиТаблицыСлов(НачальныйИтератор,КонечныйИтератор,ТаблицаСправочника,ТаблицаСлов)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Для НомерСтроки = НачальныйИтератор По КонечныйИтератор Цикл
		СтрокаСсылки = ТаблицаСправочника[НомерСтроки-1];
		
		СписокСлов = ОбработкаОбъект.ПолучитьСписокСлов(СтрокаСсылки.ЗначениеРеквизита);
		
		НоваяСтрока = Новый Структура("НомерСтроки,ПометкаУдаления,Ссылка,ЗначениеРеквизита,СписокСлов");
		НоваяСтрока.НомерСтроки = НомерСтроки;
		НоваяСтрока.Ссылка =  СтрокаСсылки.Ссылка;
		НоваяСтрока.ПометкаУдаления =  Ложь;
		НоваяСтрока.ЗначениеРеквизита = СтрокаСсылки.ЗначениеРеквизита;
		НоваяСтрока.СписокСлов = СписокСлов.Скопировать();
		
		ТаблицаСлов.Добавить(НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НайтиПоСовпадающимСловам_АнализРазличий(НачальныйИтератор,КонечныйИтератор,ТекущаяГруппа,ТаблицаСлов)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Для НомерСтроки = НачальныйИтератор По КонечныйИтератор Цикл

		Если ТаблицаСлов.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ТекущаяГруппа = ТекущаяГруппа + 1;
		КоличествоСтрок = ТаблицаСлов.Количество();
		СписокСтрок = Новый СписокЗначений;
		
		ОбрабатываемаяСтрока = ТаблицаСлов[НомерСтроки-1];
		
		Если ОбрабатываемаяСтрока.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		СписокСтрок.Добавить(ОбрабатываемаяСтрока);
		ТекущийСписокСлов = ОбрабатываемаяСтрока.СписокСлов.Скопировать();
		
		Для Индекс = НомерСтроки По КоличествоСтрок-1 Цикл
			
			Если Индекс >= КоличествоСтрок Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаСравнения = ТаблицаСлов[Индекс];
			
			Если СтрокаСравнения.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			СписокСловСравнения = СтрокаСравнения.СписокСлов.Скопировать();
			СписокНеНайденных = Новый СписокЗначений;
			
			ОдинаковыхСлов = 0;
			Для Каждого Слово Из ТекущийСписокСлов Цикл
				ЭлементСпискаСравнения = СписокСловСравнения.НайтиПоЗначению(Слово.Значение);
				Если ЭлементСпискаСравнения = Неопределено Тогда
					СписокНеНайденных.Добавить(Слово.Значение);
				Иначе
					СписокСловСравнения.Удалить(ЭлементСпискаСравнения);
					ОдинаковыхСлов = ОдинаковыхСлов + 1;
				КонецЕсли;
			КонецЦикла;
			
			
			Если СписокНеНайденных.Количество()=0 И СписокСловСравнения.Количество()=0 Тогда
				ЕстьОтличия = Ложь;
			Иначе
				Если ОдинаковыхСлов>0 Тогда
					ЕстьОтличия = ОбработкаОбъект.АнализРазличийВСловах(СписокНеНайденных, СписокСловСравнения, ТекущийСписокСлов, ОдинаковыхСлов, Объект.ДопустимоеРазличиеСлов);
				Иначе
					ЕстьОтличия = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЕстьОтличия Тогда
				СписокСтрок.Добавить(СтрокаСравнения);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаИзСписка ИЗ СписокСтрок Цикл
			Если СписокСтрок.Количество() > 1 Тогда
				СтрокаРезультата = РезультатыПоиска.Добавить();
				СтрокаРезультата.ЗначениеРеквизита = СтрокаИзСписка.Значение.ЗначениеРеквизита;
				СтрокаРезультата.Ссылка = СтрокаИзСписка.Значение.Ссылка;
				СтрокаРезультата.НомерГруппы =  - ТекущаяГруппа;
			Иначе
				ТекущаяГруппа = ТекущаяГруппа - 1;
			КонецЕсли;
			ТаблицаСлов[СтрокаИзСписка.Значение.НомерСтроки-1].ПометкаУдаления = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоСовпадающимСловам()
	
	КоличествоОбращенийКСерверу = 50; //от 1 до 100
	
	Состояние("Получение элементов справочника...");
	ТаблицаСправочника = НайтиПоСовпадающимСловам_ПолучитьЭлементыСправочника();
	
	ТаблицаСлов = Новый Массив;
	
	НачальныйИтератор = 1;
	Итерация = Окр(ТаблицаСправочника.Количество()/КоличествоОбращенийКСерверу);
	Итерация = ?(Итерация<1,1,Итерация);
	Пока НачальныйИтератор<=ТаблицаСправочника.Количество() Цикл
		КонечныйИтератор = НачальныйИтератор + Итерация;
		КонечныйИтератор = ?(КонечныйИтератор>ТаблицаСправочника.Количество(),ТаблицаСправочника.Количество(),КонечныйИтератор);
		Состояние("Разбивка значений на отдельные слова...",Окр(КонечныйИтератор/ТаблицаСправочника.Количество()*100));
		
		ОбработкаПрерыванияПользователя();
		
		НайтиПоСовпадающимСловам_ПолучитьСтрокиТаблицыСлов(НачальныйИтератор,КонечныйИтератор,ТаблицаСправочника,ТаблицаСлов);
		
		НачальныйИтератор = КонечныйИтератор + 1;
		Если НачальныйИтератор>ТаблицаСправочника.Количество() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;              
	
	ТекущаяГруппа = 0;
	
	РезультатыПоиска.Очистить();
	ТаблицаГрупп.Очистить();
	
	МаксимальноеЗначение = ТаблицаСлов.Количество();
	НачальныйИтератор = 1;
	Итерация = Окр(ТаблицаСлов.Количество()/КоличествоОбращенийКСерверу);
	Итерация = ?(Итерация<1,1,Итерация);
	Пока ТаблицаСлов.Количество() > 0 Цикл
		КонечныйИтератор = НачальныйИтератор + Итерация;
		КонечныйИтератор = ?(КонечныйИтератор>ТаблицаСправочника.Количество(),ТаблицаСправочника.Количество(),КонечныйИтератор);
		Состояние("Выполняется анализ значений реквизита...",Окр(КонечныйИтератор/МаксимальноеЗначение*100));
		
		ОбработкаПрерыванияПользователя();
		
		НайтиПоСовпадающимСловам_АнализРазличий(НачальныйИтератор,КонечныйИтератор,ТекущаяГруппа,ТаблицаСлов);
		
		НачальныйИтератор = КонечныйИтератор + 1;
		Если НачальныйИтератор>ТаблицаСлов.Количество() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Состояние("Обработка результатов...");
	Если РезультатыПоиска.Количество() > 0 Тогда
		
		РезультатыПоиска.Сортировать("НомерГруппы УБЫВ");
		
		СтруктураПоиска = Новый Структура;
		ВсегоГрупп =  - РезультатыПоиска[РезультатыПоиска.Количество()-1].НомерГруппы;
		Для Индекс = 1 по ВсегоГрупп Цикл
			
			СтруктураПоиска.Вставить("НомерГруппы",  - индекс);
			МассивСтрок = РезультатыПоиска.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСтрок.Количество() > 0 Тогда			
				ДобавитьНовуюГруппу(Индекс, МассивСтрок.Количество(), МассивСтрок[0].ЗначениеРеквизита);
			КонецЕсли;
									
		КонецЦикла;
		
		ТекущаяГруппа = 1;
		ТаблицаГрупп.Сортировать("Количество УБЫВ");
		
		Для Каждого СтрокаГруппы ИЗ ТаблицаГрупп Цикл
			СтруктураПоиска.Вставить("НомерГруппы",  - СтрокаГруппы.НомерГруппы);
			МассивСтрок = РезультатыПоиска.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаРезультата ИЗ МассивСтрок Цикл
				СтрокаРезультата.НомерГруппы = ТекущаяГруппа;
			КонецЦикла;
			СтрокаГруппы.НомерГруппы = ТекущаяГруппа;
			ТекущаяГруппа = ТекущаяГруппа + 1;
		КонецЦикла;
		
		ТаблицаГрупп.Сортировать("Группа");
		
		Если РезультатыПоиска.Количество() > 0 Тогда
			ВывестиГруппу(1);
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ОпределитьПравильныеЭлементы()
	
	Для каждого СтрокаТЗ Из РезультатыПоиска Цикл
		СтрокаТЗ.Правильный = Ложь;
	КонецЦикла;
	
	мРезультатыПоиска = РезультатыПоиска.Выгрузить();
	
	ТаблицаСсылок = НайтиПоСсылкам(мРезультатыПоиска.ВыгрузитьКолонку("Ссылка"));
	ТаблицаСсылок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаСсылок.ЗаполнитьЗначения(1,"Количество");
	ТаблицаСсылок.Свернуть("Ссылка", "Количество");
	СоответствиеСсылок = Новый Соответствие;
	Для каждого Строка Из ТаблицаСсылок Цикл
		СоответствиеСсылок.Вставить(Строка.Ссылка, Строка.Количество);
	КонецЦикла;
	
	СтрокиПравильных = Новый Соответствие;
	Для каждого Строка Из РезультатыПоиска Цикл
		КоличествоСсылок = СоответствиеСсылок[Строка.Ссылка];
		КоличествоСсылок = ?(КоличествоСсылок = Неопределено, 0, КоличествоСсылок);
		Строка.КоличествоСсылок = КоличествоСсылок;
		
		НомерГруппы = Строка.НомерГруппы;
		
		СтрокаПравильного = СтрокиПравильных[НомерГруппы];
		Если СтрокаПравильного = Неопределено Или СтрокаПравильного.КоличествоСсылок < КоличествоСсылок Тогда
			СтрокиПравильных.Вставить(НомерГруппы, Строка);
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого СтрокаПравильного Из СтрокиПравильных Цикл
		СтрокаПравильного.Значение.Правильный = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПоискСсылок(ЗагружатьВТаблицу = Истина, ТаблицаЗначений = Неопределено)
	
	Если НайденныеОбъекты.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НайденВерныйЭлемент = Ложь;
	МассивСсылок = Новый Массив();
	
	Для Каждого Строка Из НайденныеОбъекты Цикл
		
		Если Строка.Правильный Тогда
			НайденВерныйЭлемент = Истина;
			Продолжить;
		КонецЕсли;
		
		МассивСсылок.Добавить(Строка.Ссылка);
		
	КонецЦикла;
	
	Если НЕ НайденВерныйЭлемент Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаСсылок = НайтиПоСсылкам(МассивСсылок);
	Если ЗагружатьВТаблицу Тогда
		НайденныеСсылки.Загрузить(НайтиПоСсылкам(МассивСсылок));
	Иначе
		ТаблицаЗначений = ТаблицаСсылок;
	КонецЕсли;
	
	Возврат ТаблицаСсылок.Количество() > 0;
	
КонецФункции

&НаСервере
Функция ПолучитьСхемуКомпоновки(ТекстЗапроса)
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных();		
    	
	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "Источник1";
	Источник.СтрокаСоединения="";
	Источник.ТипИсточникаДанных = "local";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.Имя = "Запрос";
	НаборДанных.ИсточникДанных = "Источник1";
	
	Возврат СхемаКомпоновки;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАМЕНЫ ССЫЛОК ДУБЛИКАТОВ

&НаСервере
Процедура УдалитьЭлементыПослеЗамены()
	
	СтруктураПоиска = Новый Структура("НомерГруппы", ТекущаяГруппа);
	
	СтрокиКУдалению = Новый ТаблицаЗначений;
	СтрокиКУдалению.Колонки.Добавить("СтрокаТаблицы");
	СтрокиКУдалению.Колонки.Добавить("ТаблицаЗначений");
	
	БылиИсключения = Ложь;
	Если ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	МассивСтрок = НайденныеОбъекты.НайтиСтроки(Новый Структура("Правильный", Ложь));
	Для Каждого Строка ИЗ МассивСтрок Цикл
		          		
		СтруктураПоиска.Вставить("Ссылка", Строка.Ссылка);
		МассивРезультатов = РезультатыПоиска.НайтиСтроки(СтруктураПоиска);
		
		ОбъектСсылки = Строка.Ссылка.ПолучитьОбъект();		
		Попытка
			ОбъектСсылки.УстановитьПометкуУдаления(Истина);
		Исключение
			Если ВыполнятьВТранзакции Тогда
				БылиИсключения = Истина;
				Прервать;
			КонецЕсли;
		КонецПопытки;
		
		Если МассивРезультатов.Количество()>0 Тогда
			НовСтр = СтрокиКУдалению.Добавить();
			НовСтр.СтрокаТаблицы = МассивРезультатов[0];
			НовСтр.ТаблицаЗначений = "РезультатыПоиска";
		КонецЕсли;
		
		НовСтр = СтрокиКУдалению.Добавить();
		НовСтр.СтрокаТаблицы = Строка;
		НовСтр.ТаблицаЗначений = "НайденныеОбъекты";			
		
	КонецЦикла;
	
	Если ВыполнятьВТранзакции Тогда
		Если БылиИсключения Тогда
			ОтменитьТранзакцию();
		Иначе
			ЗафиксироватьТранзакцию();			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ БылиИсключения Тогда
		Для Каждого СтрокаКУдалению ИЗ СтрокиКУдалению Цикл
			Если СтрокаКУдалению.ТаблицаЗначений = "РезультатыПоиска" Тогда
				РезультатыПоиска.Удалить(СтрокаКУдалению.СтрокаТаблицы);
			Иначе
				НайденныеОбъекты.Удалить(СтрокаКУдалению.СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗаменуЭлементовНаСервере(ПравильныйЭлемент, МассивСсылокПоиска = Неопределено)
	
	Если МассивСсылокПоиска = Неопределено Тогда
		ТаблицаСсылок = Неопределено;
		ВыполнитьПоискСсылок(Ложь, ТаблицаСсылок);
	Иначе
		ТаблицаСсылок = НайтиПоСсылкам(МассивСсылокПоиска);
	КонецЕсли;
	
	БылиИсключения = Ложь;
	Если ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	ОбрабатываемаяСсылка = Неопределено;
		
	ПараметрыЗамены = Новый Структура;
	
	Для Каждого РегистрБухгалтерии ИЗ Метаданные.РегистрыБухгалтерии Цикл
		ПараметрыЗамены.Вставить(РегистрБухгалтерии.Имя+"Субконто", РегистрБухгалтерии.ПланСчетов.МаксКоличествоСубконто);
		ПараметрыЗамены.Вставить(РегистрБухгалтерии.Имя+"Корреспонденция", РегистрБухгалтерии.Корреспонденция);		
	КонецЦикла;
	
	ПараметрыЗамены.Вставить("Объект", Неопределено);	
	
	Для Каждого СтрокаТаблицы Из ТаблицаСсылок Цикл
		
		Ссылка = СтрокаТаблицы.Ссылка;
		
		Если ОбрабатываемаяСсылка <> СтрокаТаблицы.Данные Тогда
			Если ОбрабатываемаяСсылка <> Неопределено и ПараметрыЗамены.Объект <> Неопределено Тогда
				
				Если ОтключатьКонтрольЗаписи Тогда
					ПараметрыЗамены.Объект.ОбменДанными.Загрузка = Истина;
				КонецЕсли;
				
				Попытка
					ПараметрыЗамены.Объект.Записать();
				Исключение
					БылиИсключения = Истина;
					Если ВыполнятьВТранзакции Тогда
						Возврат ВыполнитьОткат();
					КонецЕсли;
				КонецПопытки;
				ПараметрыЗамены.Объект = Неопределено;
			КонецЕсли;
			ОбрабатываемаяСсылка = СтрокаТаблицы.Данные;
			
		КонецЕсли;
		
			
		Если Метаданные.Документы.Содержит(СтрокаТаблицы.Метаданные) Тогда
			
			Если ПараметрыЗамены.Объект = Неопределено Тогда
				ПараметрыЗамены.Объект = СтрокаТаблицы.Данные.ПолучитьОбъект();
			КонецЕсли;
			
			Для Каждого Реквизит Из СтрокаТаблицы.Метаданные.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И ПараметрыЗамены.Объект[Реквизит.Имя] = Ссылка Тогда
					ПараметрыЗамены.Объект[Реквизит.Имя] = ПравильныйЭлемент;
				КонецЕсли;
			КонецЦикла;
				
			Для Каждого ТЧ ИЗ СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
				Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						Пока СтрокаТабЧасти <> Неопределено Цикл
							СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
							СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			Для Каждого Движение ИЗ СтрокаТаблицы.Метаданные.Движения Цикл
				
				ЭтоДвижениеРегистраБухгалтерии = Метаданные.РегистрыБухгалтерии.Содержит(Движение);
				ЕстьКорреспонденция = ЭтоДвижениеРегистраБухгалтерии и ПараметрыЗамены[Движение.Имя + "Корреспонденция"];
				
				НаборЗаписей  = ПараметрыЗамены.Объект.Движения[Движение.Имя];
				НаборЗаписей.Прочитать();
				НадоЗаписывать = Ложь;
				ТаблицаНабора = НаборЗаписей.Выгрузить();
				Для Каждого Измерение ИЗ Движение.Измерения Цикл
					Если Измерение.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						Если ЕстьКорреспонденция Тогда
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Измерение.Имя + "ДТ");
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти[Измерение.Имя + "ДТ"] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Измерение.Имя + "ДТ");
							КонецЦикла;
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Измерение.Имя + "КТ");
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти[Измерение.Имя + "КТ"] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Измерение.Имя + "КТ");
							КонецЦикла;
						Иначе
							
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Измерение.Имя);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти[Измерение.Имя] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Измерение.Имя);
							КонецЦикла;
						КонецЕсли;
					КонецЕсли; 
				КонецЦикла;
				
				Если Метаданные.РегистрыСведений.Содержит(Движение) Тогда
					Для Каждого Ресурс ИЗ Движение.Ресурсы Цикл
						Если Ресурс.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Ресурс.Имя);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти[Ресурс.Имя] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Ресурс.Имя);
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Для Каждого Реквизит ИЗ Движение.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Реквизит.Имя);
						Пока СтрокаТабЧасти <> Неопределено Цикл
							СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
							НадоЗаписывать = Истина;
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, Реквизит.Имя);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
				Если Метаданные.РегистрыБухгалтерии.Содержит(Движение) Тогда
					
					Для ИндексСубконто = 1 по ПараметрыЗамены[Движение.Имя + "Субконто"] Цикл
						Если ЕстьКорреспонденция Тогда
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоДт"+ИндексСубконто);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти["СубконтоДт"+ИндексСубконто] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоДт"+ИндексСубконто);
							КонецЦикла;
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоКт"+ИндексСубконто);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти["СубконтоКт"+ИндексСубконто] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоКт"+ИндексСубконто);
							КонецЦикла;								
						Иначе							
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "Субконто"+ИндексСубконто);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти["Субконто"+ИндексСубконто] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "Субконто"+ИндексСубконто);
							КонецЦикла;							
						КонецЕсли;						
					КонецЦикла;					
				КонецЕсли;
								
				
				Если НадоЗаписывать Тогда
					НаборЗаписей.Загрузить(ТаблицаНабора);
					Если ОтключатьКонтрольЗаписи Тогда
						НаборЗаписей.ОбменДанными.Загрузка = Истина;
					КонецЕсли;
					Попытка
						НаборЗаписей.Записать();
					Исключение
						БылиИсключения = Истина;
						Если ВыполнятьВТранзакции Тогда
							Возврат ВыполнитьОткат();
						КонецЕсли;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
			
			
			Для Каждого Последовательность ИЗ Метаданные.Последовательности Цикл
				Если Последовательность.Документы.Содержит(СтрокаТаблицы.Метаданные) Тогда
					НадоЗаписывать = Ложь;
					НаборЗаписи = Последовательности[Последовательность.Имя].СоздатьНаборЗаписей();
					НаборЗаписи.Отбор.Регистратор.Установить(СтрокаТаблицы.Данные);
					НаборЗаписи.Прочитать();
					
					Для Каждого Измерение ИЗ Последовательность.Измерения Цикл
						Если Измерение.Тип.СодержитТип(ТипЗнч(Ссылка)) И НаборЗаписи[0][Измерение.Имя]=Ссылка Тогда
							НаборЗаписи[0][Измерение.Имя] = ПравильныйЭлемент;
							НадоЗаписывать = Истина;
						КонецЕсли;
					КонецЦикла;					
					Если НадоЗаписывать Тогда
						Если ОтключатьКонтрольЗаписи Тогда
							НаборЗаписи.ОбменДанными.Загрузка = Истина;
						КонецЕсли;
						Попытка
							НаборЗаписи.Записать();
						Исключение
							БылиИсключения = Истина;
							Если ВыполнятьВТранзакции Тогда
								Возврат ВыполнитьОткат();
							КонецЕсли;
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			
			
		ИначеЕсли Метаданные.Справочники.Содержит(СтрокаТаблицы.Метаданные) Тогда
			
			Если ПараметрыЗамены.Объект = Неопределено Тогда
				ПараметрыЗамены.Объект = СтрокаТаблицы.Данные.ПолучитьОбъект();
			КонецЕсли;
			
			Если СтрокаТаблицы.Метаданные.Владельцы.Содержит(Ссылка.Метаданные()) И ПараметрыЗамены.Объект.Владелец = Ссылка Тогда
				ПараметрыЗамены.Объект.Владелец = ПравильныйЭлемент;
			КонецЕсли;
			
			Если СтрокаТаблицы.Метаданные.Иерархический И ПараметрыЗамены.Объект.Родитель = Ссылка Тогда
				ПараметрыЗамены.Объект.Родитель = ПравильныйЭлемент;
			КонецЕсли;
			
			Для Каждого Реквизит Из СтрокаТаблицы.Метаданные.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И ПараметрыЗамены.Объект[Реквизит.Имя] = Ссылка Тогда
					ПараметрыЗамены.Объект[Реквизит.Имя] = ПравильныйЭлемент;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ТЧ ИЗ СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
				Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						Пока СтрокаТабЧасти <> Неопределено Цикл
							СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
							СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(СтрокаТаблицы.Метаданные)
				  ИЛИ Метаданные.ПланыСчетов.Содержит(СтрокаТаблицы.Метаданные)
				  ИЛИ Метаданные.ПланыВидовРасчета.Содержит(СтрокаТаблицы.Метаданные)
				  ИЛИ Метаданные.Задачи.Содержит(СтрокаТаблицы.Метаданные)
				  ИЛИ Метаданные.БизнесПроцессы.Содержит(СтрокаТаблицы.Метаданные) Тогда
			
			Если ПараметрыЗамены.Объект = Неопределено Тогда
				ПараметрыЗамены.Объект = СтрокаТаблицы.Данные.ПолучитьОбъект();
			КонецЕсли;
						
			Для Каждого Реквизит Из СтрокаТаблицы.Метаданные.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И ПараметрыЗамены.Объект[Реквизит.Имя] = Ссылка Тогда
					ПараметрыЗамены.Объект[Реквизит.Имя] = ПравильныйЭлемент;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ТЧ ИЗ СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
				Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						Пока СтрокаТабЧасти <> Неопределено Цикл
							СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
							СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						КонецЦикла;							
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;	
			
		ИначеЕсли Метаданные.Константы.Содержит(СтрокаТаблицы.Метаданные) Тогда
			
			Константы[СтрокаТаблицы.Метаданные.Имя].Установить(ПравильныйЭлемент);
			
			
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(СтрокаТаблицы.Метаданные) Тогда	
			
			СтруктураИзмерений = Новый Структура;
			НаборЗаписей = РегистрыСведений[СтрокаТаблицы.Метаданные.Имя].СоздатьНаборЗаписей();
			Для Каждого Измерение ИЗ СтрокаТаблицы.Метаданные.Измерения Цикл
				НаборЗаписей.Отбор[Измерение.Имя].Установить(СтрокаТаблицы.Данные[Измерение.Имя]);
				СтруктураИзмерений.Вставить(Измерение.Имя);
			КонецЦикла;
			Если СтрокаТаблицы.Метаданные.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
				НаборЗаписей.Отбор["Период"].Установить(СтрокаТаблицы.Данные.Период);
			КонецЕсли;
			НаборЗаписей.Прочитать();
			ТаблицаНабора = НаборЗаписей.Выгрузить();
			НаборЗаписей.Очистить();
			
			Если ОтключатьКонтрольЗаписи Тогда
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
			КонецЕсли;
			
			
			Если Не ВыполнятьВТранзакции Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			Попытка
				
				НаборЗаписей.Записать();
				
				Для Каждого Колонка ИЗ ТаблицаНабора.Колонки Цикл
					Если ТаблицаНабора[0][Колонка.Имя] = Ссылка Тогда
						ТаблицаНабора[0][Колонка.Имя] = ПравильныйЭлемент;
						Если СтруктураИзмерений.Свойство(Колонка.Имя) Тогда
							НаборЗаписей.Отбор[Колонка.Имя].Установить(ПравильныйЭлемент);
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
				НаборЗаписей.Загрузить(ТаблицаНабора);
				
				НаборЗаписей.Записать();
				
				Если Не ВыполнятьВТранзакции Тогда
					ЗафиксироватьТранзакцию();
				КонецЕсли; 
				
			Исключение
				
				Если ВыполнятьВТранзакции Тогда
					БылиИсключения = Истина;
					Возврат ВыполнитьОткат();
				Иначе
					ОтменитьТранзакцию();
				КонецЕсли;
				
			КонецПопытки;
			
		Иначе
			Сообщить("Ссылки типа "+СтрокаТаблицы.Метаданные+" не заменяются!!");
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыЗамены.Объект <> Неопределено Тогда
		Если ОтключатьКонтрольЗаписи Тогда
			ПараметрыЗамены.Объект.ОбменДанными.Загрузка = Истина;
		КонецЕсли;
		Попытка
			ПараметрыЗамены.Объект.Записать();
		Исключение
			БылиИсключения = Истина;
			Если ВыполнятьВТранзакции Тогда
				Возврат ВыполнитьОткат();
			КонецЕсли;
		КонецПопытки;
	КонецЕсли;
	
	Если ВыполнятьВТранзакции Тогда
		Если БылиИсключения Тогда
			ОтменитьТранзакцию();
		Иначе
			ЗафиксироватьТранзакцию();
		КонецЕсли;	
	КонецЕсли;
	Возврат Не БылиИсключения;
	
КонецФункции

&НаСервере
Функция ВыполнитьОткат()
	
	ОтменитьТранзакцию();
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура АвтозаменаЭлементов(ПомечатьОбъектыНаУдаление)
	
	Если РезультатыПоиска.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоискаПравильных = Новый Структура("Правильный",Истина);
	ПравильныеСтроки = РезультатыПоиска.НайтиСтроки(СтруктураПоискаПравильных);
	
	НомерГруппы = 0;
	Для Каждого СтрокаПравильного Из ПравильныеСтроки Цикл
		НомерГруппы = НомерГруппы + 1;
		СтруктураПоиска = Новый Структура("НомерГруппы, Правильный",СтрокаПравильного.НомерГруппы, Ложь);
		МассивСсылок = Новый Массив;
		МассивНеправильныхСтрок = РезультатыПоиска.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаНеправильного Из МассивНеправильныхСтрок Цикл
			МассивСсылок.Добавить(СтрокаНеправильного.Ссылка);
		КонецЦикла;
		
		ЗаменаВыполнена = ВыполнитьЗаменуЭлементовНаСервере(СтрокаПравильного.Ссылка, МассивСсылок);
		
		Если ПомечатьОбъектыНаУдаление И (ЗаменаВыполнена Или Не ВыполнятьВТранзакции) Тогда
			ТаблицаОставшихсяСсылок = НайтиПоСсылкам(МассивСсылок);
			ТаблицаОставшихсяСсылок.Свернуть("Ссылка");
			Для каждого СтрокаНеправильного Из МассивНеправильныхСтрок Цикл
				Если ТаблицаОставшихсяСсылок.Найти(СтрокаНеправильного.Ссылка, "Ссылка") = Неопределено Тогда
					
					ОбъектСсылки = СтрокаНеправильного.Ссылка.ПолучитьОбъект();
					Если ОбъектСсылки <> Неопределено Тогда
						Попытка
							ОбъектСсылки.УстановитьПометкуУдаления(Истина);
							РезультатыПоиска.Удалить(СтрокаНеправильного);
						Исключение
							Сообщить(ОписаниеОшибки());
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещений(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры = "ОтсутствиеПрав" Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросов(РезультатВопроса,ДополнительныеПараметры) Экспорт
	
	ТипВопроса = ДополнительныеПараметры;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ТипВопроса = ДополнительныеПараметры.ТипВопроса;
	КонецЕсли;
	
	Если ТипВопроса = "ОбработкаВопросов" И
		РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НайтиДублиПослеВопросаКПользователю();
	ИначеЕсли ТипВопроса = "ВыборПравильного" И
		РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗамену(Неопределено);
	ИначеЕсли ТипВопроса = "ВыполнитьЗаменуЭлементов" И
		РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаменуЭлементовПослеВопросаКПользователю(ДополнительныеПараметры.СсылкаНаПравильный);
	ИначеЕсли ТипВопроса = "АвтозаменаВоВсехГруппах" И
		РезультатВопроса = КодВозвратаДиалога.Да Тогда
		АвтозаменаВоВсехГруппахПослеВопросаКПользователю(РезультатВопроса = КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	
	СправочникДляПоискаСписокЗначений.Очистить();
	Для Каждого ОбъектМетаданных Из Метаданные["Справочники"] Цикл
		СправочникДляПоискаСписокЗначений.Добавить(Новый Структура("Имя,Представление",ОбъектМетаданных.Имя,ОбъектМетаданных.Синоним),ОбъектМетаданных.Синоним);
	КонецЦикла;
	СправочникДляПоискаСписокЗначений.СортироватьПоПредставлению();
	
	Объект.ДопустимоеРазличиеСлов = 30;
	РежимПоиска = 1;
	ПредлагатьЗаменитьЭлементыПриУказанииПравильного = Истина;
	
	ВыполнятьВТранзакции = Истина;
	ЗадаватьВопросПередНачаломЗамены = Истина;
	ОтключатьКонтрольЗаписи = Истина;
	ПослеЗаменыВозвратитсяНаЗакладкуРезультатовПоиска = Истина;
	УведомлятьПользователяОбОкончанииЗамены = Истина;
	УдалятьЭлементыПослеЗамены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПолныеПрава Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ОбработкаОповещений",ЭтаФорма,"ОтсутствиеПрав"),"Для выполнения поиска и замены дублирующихся элементов необходимо наличие роли ""Полные права"" !");
	КонецЕсли;
	
	УстановитьДоступностьЭлементаСходстваСлов();
	
КонецПроцедуры

&НаКлиенте
Процедура СправочникДляПоискаОбработкаВыбора(ВыбранныйЭлемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = ВыбранныйЭлемент.Значение;
	
	СправочникДляПоиска = ВыбранноеЗначение.Представление;
	ОбрабатываемыйСправочник = ВыбранноеЗначение;
	
	ДополнительныйОтбор = Неопределено;
	
	ОбновитьПереченьРеквизитовИДополнительныйОтбор(ВыбранноеЗначение);
	
	РежимПоискаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СправочникДляПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СправочникДляПоискаСписокЗначений.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("СправочникДляПоискаОбработкаВыбора",ЭтаФорма),"Выбор справочника");
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитДляПоискаОбработкаВыбора(ВыбранныйЭлемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = ВыбранныйЭлемент.Значение;
	
	РеквизитДляПоиска = ВыбранноеЗначение.Представление;
	ОбрабатываемыйРеквизит = ВыбранноеЗначение.Имя;
	
	РежимПоискаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитДляПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	РеквизитДляПоискаСписокЗначений.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("РеквизитДляПоискаОбработкаВыбора",ЭтаФорма),"Выбор реквизита");

КонецПроцедуры

&НаСервере
Функция ОпределитьВозможностьУстановкиРежимаПоискаДляТекущийхДанных()
	
	Если СокрЛП(ОбрабатываемыйРеквизит) = "" Тогда
		Возврат Истина;
	КонецЕсли;
	
	// режим поиска по похожим словам
	Если ОбрабатываемыйРеквизит = "Владелец"
		ИЛИ ОбрабатываемыйРеквизит = "Родитель" Тогда
		Возврат Ложь;
	ИначеЕсли ОбрабатываемыйРеквизит = "Код" Тогда
		Если Метаданные.Справочники[ОбрабатываемыйСправочник.Имя].ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Число Тогда
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ОбрабатываемыйРеквизит = "Наименование" Тогда	 
		Возврат Истина;
	Иначе
		ТипРеквизита = Метаданные.Справочники[ОбрабатываемыйСправочник.Имя].Реквизиты[ОбрабатываемыйРеквизит].Тип;
		Если Не ТипРеквизита.СодержитТип(Тип("Строка")) Тогда
			Возврат Ложь;					
		КонецЕсли;			
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементаСходстваСлов()
	
	Элементы.ДопустимоеРазличиеСлов.Доступность = (РежимПоиска = 2);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПоискаПриИзменении(Элемент)
	
	Если ПустаяСтрока(ОбрабатываемыйРеквизит) Тогда
		ДоступностьРежимаПоиска = Истина;
	Иначе
		ДоступностьРежимаПоиска = ОпределитьВозможностьУстановкиРежимаПоискаДляТекущийхДанных();
	КонецЕсли;
	
	Элементы.РежимПоиска.Доступность = ДоступностьРежимаПоиска;
	
	УстановитьДоступностьЭлементаСходстваСлов();
	
КонецПроцедуры

&НаКлиенте
Процедура НайденныеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НайденныеОбъекты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(,ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаГруппПриАктивизацииСтроки(Элемент)
	
	НомерТекГруппы = ТекущаяГруппа();
	Если НомерТекГруппы > 0 Тогда
		ВывестиГруппу(НомерТекГруппы);
	КонецЕсли;
	
	УстановитьДоступностьВыполненияЗамены();
	
КонецПроцедуры

&НаКлиенте
Процедура НайденныеСсылкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.НайденныеСсылки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Данные) <> Тип("Строка") Тогда
		ОткрытьЗначение(ТекущиеДанные.Данные);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура НайтиДубли(Команда)
	
	Если НЕ ЗначениеЗаполнено(ОбрабатываемыйСправочник) Тогда
		ИнтерактивноеСообщение("СправочникДляПоиска","Не указан справочник для поиска");
		Возврат;
	КонецЕсли;
	
	Если СокрЛП(ОбрабатываемыйРеквизит) = "" Тогда
		ИнтерактивноеСообщение("РеквизитДляПоиска","Не указан реквизит поиска");
		Возврат;
	КонецЕсли;
	
	// нужно заранее узнать количество элементов для поиска
	Если РежимПоиска = 2 тогда
		КоличествоЭлементовДляПоиска = ОпределитьКоличествоЭлементовДляПоискаВСправочнике();
		Если КоличествоЭлементовДляПоиска > 1000 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросов",ЭтаФорма,"ПоискПоПохожимСловам"),
			"Поиск по похожим словам может занять значительное время." + Символы.ПС + "Начать поиск?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			Возврат; //ожидание ответа пользователя
		КонецЕсли;
	КонецЕсли;
	
	НайтиДублиПослеВопросаКПользователю();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиДублиПослеВопросаКПользователю()
	
	Состояние("Получение элементов справочника...");
	
	Если РежимПоиска = 1 Тогда
		НайтиПоРавенствуРеквизитов();
	ИначеЕсли РежимПоиска = 2 Тогда
		НайтиПоСовпадающимСловам();
	Иначе
		ИнтерактивноеСообщение("РежимПоиска","Не указан режим поиска");
		Возврат;
	КонецЕсли;
	
	Если ТаблицаГрупп.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Не выявлено дублей элементов.");
		Возврат;
	Иначе
		Элементы.СтраницыОбработки.ТекущаяСтраница = Элементы.СтраницаРезультатовПоиска;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПравильного(Команда)
	
	Если Элементы.НайденныеОбъекты.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//сброс правильности у всех объектов:
	СтрокиТаблицы = НайденныеОбъекты.НайтиСтроки(Новый Структура("Правильный",Истина));
	Для каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		
		СтрокаТаблицы.Правильный = Ложь;
		
		СтрокиОсновнойТаблицы = РезультатыПоиска.НайтиСтроки(Новый Структура("Ссылка", СтрокаТаблицы.Ссылка));
		Для каждого СтрокаОсновнойТаблицы Из СтрокиОсновнойТаблицы Цикл
			СтрокаОсновнойТаблицы.Правильный = Ложь;		
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.НайденныеОбъекты.ТекущиеДанные.Правильный = Истина;
	
	СтрокиОсновнойТаблицы = РезультатыПоиска.НайтиСтроки(Новый Структура("Ссылка", Элементы.НайденныеОбъекты.ТекущиеДанные.Ссылка));
	Для каждого СтрокаОсновнойТаблицы Из СтрокиОсновнойТаблицы Цикл
		СтрокаОсновнойТаблицы.Правильный = Истина;		
	КонецЦикла;
	
	УстановитьДоступностьВыполненияЗамены();
	
	Если ПредлагатьЗаменитьЭлементыПриУказанииПравильного Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросов",ЭтаФорма,"ВыборПравильного"),
		"Выполнить замену ссылок для оставшихся элементов?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКНастройкамПоиска(Команда)
	
	Элементы.СтраницыОбработки.ТекущаяСтраница = Элементы.СтраницаНастроек;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	Состояние("Получение элементов справочника...");
	Если РежимПоиска = 1 Тогда
		НайтиПоРавенствуРеквизитов();
	ИначеЕсли РежимПоиска = 2 Тогда
		НайтиПоСовпадающимСловам();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоопределениеПривильныхОбъектовВоВсехГруппах(Команда)
	
	Состояние("Автоматическое определение правильных элементов...");
	ОпределитьПравильныеЭлементы();
	ВывестиГруппу(ТекущаяГруппа());
	
	УстановитьДоступностьВыполненияЗамены();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗамену(Команда)
	
	Состояние("Поиск ссылок на элемент...");
	
	РезультатПерехода = ВыполнитьПоискСсылок();
		
	Если РезультатПерехода Тогда
		Элементы.СтраницыОбработки.ТекущаяСтраница = Элементы.СтраницаНайденныхСсылок;
	Иначе
		ПоказатьПредупреждение(,"Не найдено ссылок на дублирующиеся элементы");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаменуЭлементов(Команда)
	
	СтрокиПравильного = НайденныеОбъекты.НайтиСтроки(Новый Структура("Правильный",Истина));
	Если СтрокиПравильного.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Не указан правильный элемент.");
		Возврат;
	КонецЕсли;
	СтрокаПравильного = СтрокиПравильного[0];
	
	Если НЕ УдалятьЭлементыПослеЗамены
		И НайденныеСсылки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(,"Нет ссылок на объекты, подлежащие замене!");
		Возврат;
		
	КонецЕсли;
	
	Если ЗадаватьВопросПередНачаломЗамены Тогда
		
		Если УдалятьЭлементыПослеЗамены Тогда
			ТекстСообщенияПользователю = "Замена и пометка на удаление - операция необратима!";
			ТекстИтоговогоВопроса = "Выполнить замену и пометить объекты на удаление?";
		Иначе
			ТекстСообщенияПользователю = "Замена элементов - операция необратима!";
			ТекстИтоговогоВопроса = "Выполнить замену?";
		КонецЕсли;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросов",ЭтаФорма,Новый Структура("ТипВопроса,СсылкаНаПравильный","ВыполнитьЗаменуЭлементов",СтрокаПравильного.Ссылка)),
		ТекстСообщенияПользователю + Символы.ПС + ТекстИтоговогоВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьЗаменуЭлементовПослеВопросаКПользователю(СтрокаПравильного.Ссылка);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ВыполнитьЗаменуЭлементовПослеВопросаКПользователю(СсылкаНаПравильный)

	Состояние("Выполняется замена элементов...");
	
	ВыполнитьЗаменуЭлементовНаСервере(СсылкаНаПравильный);
	
	ВыполнитьПоискСсылок();
	
	Если УдалятьЭлементыПослеЗамены Тогда
		Если НайденныеСсылки.Количество() = 0 Тогда
			Состояние("Выполняется пометка объектов на удаление...");
			УдалитьЭлементыПослеЗамены();
		Иначе
			ПоказатьПредупреждение(,"На элементы есть ссылки.");
		КонецЕсли;
	КонецЕсли;
	
	Если ПослеЗаменыВозвратитсяНаЗакладкуРезультатовПоиска Тогда
		Элементы.СтраницыОбработки.ТекущаяСтраница = Элементы.СтраницаРезультатовПоиска;
	КонецЕсли;
	
	Если УведомлятьПользователяОбОкончанииЗамены Тогда
		Если УдалятьЭлементыПослеЗамены Тогда
			СтрокаСообщенияПользователю = "Замена и пометка объектов на удаление успешно завершена.";
		Иначе
			СтрокаСообщенияПользователю = "Замена элементов успешно завершена.";
		КонецЕсли;
		
		ПоказатьПредупреждение(,СтрокаСообщенияПользователю, 10);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяНазад(Команда)
	Элементы.СтраницыОбработки.ТекущаяСтраница = Элементы.СтраницаРезультатовПоиска;
КонецПроцедуры

&НаКлиенте
Процедура АвтозаменаВоВсехГруппах(Команда)
	
	Если РезультатыПоиска.НайтиСтроки(Новый Структура("Правильный",Истина)).Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Не указан правильный элемент ни в одной из групп.");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросов",ЭтаФорма,"АвтозаменаВоВсехГруппах"),
	"Внимание!!! Во всех группах, где определен правильный элемент,
	|программа выполнит автоматическую замену ссылок!
	|
	|Выполнить пометку объектов на удаление после замены?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтозаменаВоВсехГруппахПослеВопросаКПользователю(ПомечатьОбъектыНаУдаление)
	
	Состояние("Поиск и замена значений...");
	АвтозаменаЭлементов(ПомечатьОбъектыНаУдаление);
	ВывестиГруппу(ТекущаяГруппа(), Истина);
			
	ПоказатьПредупреждение(,"Замена элементов успешно завершена.", 10);
	
КонецПроцедуры