
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолноправныйПользователь = ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава();
	
	Если НЕ ПолноправныйПользователь Тогда
		Отчет.ОсновнаяОрганизация = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация"));
		Если Отчет.ОсновнаяОрганизация.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя не установлена основная организация");
			Отказ = Истина;
			Возврат;
		Иначе
			ОхотхозяйствоПользователя = Отчет.ОсновнаяОрганизация;
		КонецЕсли;
	КонецЕсли;	

	НовыеПараметрыВыбора = ОхотаСерверПовтИсп.ПолучитьПараметрыВыбораПоСубъектуРФ();
	Элементы.Охотхозяйство.ПараметрыВыбора = НовыеПараметрыВыбора;

	
КонецПроцедуры
