

&НаСервере
Процедура ЗаполнитьПоМакету()
	НачатьТранзакцию();
	Макет = Справочники.ОтчетныеВидыДичи.ПолучитьМакет("Макет");
	Стр = 1;
	
	Пока истина Цикл
	    Адрес="R"+Формат(Стр,"ЧГ=")+"C1";
	    Значение=Макет.Область(Адрес).Текст;
	    Если ПустаяСтрока(Значение) Тогда
			
			
			ЗафиксироватьТранзакцию();
			
			Прервать;
	    КонецЕсли;      
		
		элемент = Справочники.ОтчетныеВидыДичи.СоздатьЭлемент();
		элемент.Наименование = Значение;
		Попытка
			элемент.Записать();	
		Исключение
	     	ОтменитьТранзакцию();
		КонецПопытки;
		
	    Стр = Стр + 1;
	КонецЦикла;  
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОтчетныеВидыДичи.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ОтчетныеВидыДичи КАК ОтчетныеВидыДичи
		|ГДЕ
		|	НЕ ОтчетныеВидыДичи.ПометкаУдаления";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат[0].Количество = 0 Тогда
		Пустой = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОповещение() 
	
	ТекстВопроса = "Список пуст. Вы хотите заполнить автоматически?";
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение,ТекстВопроса , Режим, 0);

КонецПроцедуры


&НаКлиенте 
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ЗаполнитьПоМакету();
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Пустой Тогда
		СоздатьОповещение();
	КонецЕсли;	
КонецПроцедуры
