
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		Возврат;
	Иначе
		Отказ = ПроверитьПериод();
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьПериод()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СезоныОхоты.Ссылка,
		|	СезоныОхоты.ДатаНачала,
		|	СезоныОхоты.ДатаОкончания,
		|	&НоваяДатаНачала,
		|	&НоваяДатаОкончания
		|ПОМЕСТИТЬ ВТ1
		|ИЗ
		|	Справочник.СезоныОхоты КАК СезоныОхоты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ1.Ссылка.Представление КАК Представление,
		|	ВТ1.Ссылка,
		|	ВЫБОР
		|			КОГДА РазрешениеНаОхоту.Ссылка ЕСТЬ NULL 
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|		ИЛИ ВЫБОР
		|			КОГДА УстановкаКвотНаОхотхозяйство.Ссылка ЕСТЬ NULL 
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|		ИЛИ ВЫБОР
		|			КОГДА УстановкаОбщихКвот.Ссылка ЕСТЬ NULL 
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ КАК Невозможно
		|ИЗ
		|	ВТ1 КАК ВТ1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазрешениеНаОхоту КАК РазрешениеНаОхоту
		|		ПО ВТ1.Ссылка = РазрешениеНаОхоту.СезонОхоты
		|			И (РазрешениеНаОхоту.Дата МЕЖДУ ВТ1.НоваяДатаНачала И ВТ1.НоваяДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаОбщихКвот КАК УстановкаОбщихКвот
		|		ПО ВТ1.Ссылка = УстановкаОбщихКвот.СезонОхоты
		|			И (УстановкаОбщихКвот.Дата МЕЖДУ ВТ1.НоваяДатаНачала И ВТ1.НоваяДатаОкончания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаКвотНаОхотхозяйство КАК УстановкаКвотНаОхотхозяйство
		|		ПО ВТ1.Ссылка = УстановкаКвотНаОхотхозяйство.СезонОхоты
		|			И (УстановкаКвотНаОхотхозяйство.Дата МЕЖДУ ВТ1.НоваяДатаНачала И ВТ1.НоваяДатаОкончания)";
	
	Запрос.УстановитьПараметр("НоваяДатаНачала", ЭтотОбъект.ДатаНачала);
	Запрос.УстановитьПараметр("НоваяДатаОкончания", ЭтотОбъект.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Невозможно Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно записать сезон охоты.
			|Период сезона пересекается с " + Выборка.Представление,ЭтотОбъект);
			
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

