
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураДанных = ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОбязательныхРеквизитовРазрешения();
	
	Если СтруктураДанных <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,СтруктураДанных);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	СтруктураДанных = Новый Структура;
	
	Реквизиты = ЭтаФорма.ПолучитьРеквизиты();
	Для каждого реквизит из Реквизиты Цикл
		СтруктураДанных.Вставить(реквизит.Имя,ЭтаФорма[реквизит.Имя]);
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Хранилище = Новый ХранилищеЗначения(СтруктураДанных, Новый СжатиеДанных(9));
	Константы.ОбязательныеРеквизитыРазрешенияДляЕгеря.Установить(Хранилище);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры


