
&НаКлиенте
Процедура Печать(Команда)
	Пакет = Новый ПакетОтображаемыхДокументов;
	Пакет.ИмяПринтера = ИмяПринтера;
	Пакет.КоличествоЭкземпляров = 1;
	Пакет.РазборПоКопиям = Истина;
	Пакет.Вывод = ИспользованиеВывода.Разрешить;
	Пакет.ДвусторонняяПечать = ТипДвустороннейПечати.Нет;
	Пакет.ТочностьПечати = ТочностьПечати.Точная;
	
	
	ЭлементПакета = Пакет.Состав.Добавить();
	ЭлементПакета.Данные = ПоместитьВоВременноеХранилище(ТабДокДляПечати, УникальныйИдентификатор);
	
	РежимДиалога =  РежимИспользованияДиалогаПечати.НеИспользовать;
	
	#Если ВебКлиент Тогда
		РежимДиалога =  РежимИспользованияДиалогаПечати.Использовать;
	#КонецЕсли

		
	Пакет.Напечатать(РежимДиалога);
	Оповестить("Документ распечатан",ИмяМакета,?(ТабДокДляПечати.Области.Найти("Разрешение") = Неопределено,"Путевка","Разрешение"));
	Если ЗакрытьПослеПечати Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакрытьПослеПечати = Истина;
	ИмяМакета = Параметры.ИмяМакета;
	ПолучитьТабДок();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТабДок()
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ИмяПринтера",ИмяПринтера);
	ПараметрыПечати.Вставить("ИмяМакета",ИмяМакета);
	ПараметрыПечати.Вставить("ТабДок",ТабДок);
	ПараметрыПечати.Вставить("ТабДокДляПечати",ТабДокДляПечати);
	ПараметрыПечати.Вставить("Документ",Параметры.Документ);
	
	ИмяДокумента = Параметры.Документ.Метаданные().Имя;
		
	Документы[ИмяДокумента].ПолучитьТабДок(ТабДок,ТабДокДляПечати,ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСкрипты(ИмяКомпьютера)
	Попытка
	scrptCtrl = Новый COMОбъект("MSScriptControl.ScriptControl");
		
	scrptCtrl.language="vbscript"; 
    scrptCtrl.addcode(" 
    |Function GetDefaultPrinter() 
    |GetDefaultPrinter=vbNullString              
	|Set objWMIService=GetObject(""winmgmts:"" _ 
    |& ""{impersonationLevel=impersonate}!\\" + ИмяКомпьютера + "\root\cimv2"")            
    |Set colInstalledPrinters=objWMIService.ExecQuery _ 
    |(""Select * from Win32_Printer"") 
	|For Each objPrinter in colInstalledPrinters        
	|If objPrinter.Attributes and 4 Then 
	|GetDefaultPrinter=objPrinter.Name 
	|Exit For 
	|End If 
	|Next 
	|End Function"); 
	Исключение
		Текст = ОписаниеОшибки();
		Возврат;
	КонецПопытки;
	
    
	попытка
		ПринтерПоУмолчанию = scrptCtrl.run("GetDefaultPrinter");
	Исключение
		Текст = ОписаниеОшибки();
		Возврат;
	Конецпопытки;
	
	
	scrptCtrl1=Новый COMОбъект("MSScriptControl.ScriptControl"); 
	scrptCtrl1.language="vbscript";
	scrptCtrl1.addcode(" 
	|Function GetDefaultPrinter() 
	|Set objWMIService=GetObject(""winmgmts:"" _ 
	|& ""{impersonationLevel=impersonate}!\\" + ИмяКомпьютера + "\root\cimv2"") 
	|Set GetDefaultPrinter=objWMIService.ExecQuery _ 
	|(""Select * from Win32_Printer"") 
	|End Function"); 
	


	попытка
		мПринтеры = scrptCtrl1.run("GetDefaultPrinter");
	Исключение
		Текст = ОписаниеОшибки();
		Возврат;
	Конецпопытки;
	
	Для Каждого мпринтер из мПринтеры цикл                           //cimv2"")
		принтер = мпринтер.Name;
		ПоУмолчанию =мпринтер.Default;
		Приоритет = мпринтер.Priority;
		ИмяПорта =  ВРег(СокрЛП(СтрЗаменить(мпринтер.PortName," ","")));
		Сетевой = мпринтер.Shared;
		
		Если Найти(ВРЕГ(ИмяПорта),"FAX") ИЛИ Найти(ВРЕГ(ИмяПорта),"NUL") ИЛИ Найти(ВРЕГ(ИмяПорта),"XPS") Тогда
			Продолжить;
		КонецЕсли;	
			
		
		ПоУмолчаниюНовый = ?(принтер = ПринтерПоУмолчанию,Истина,Ложь);
		
		
		ДобавитьСтрокуПринтеров(принтер,ПоУмолчанию);
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	#Если НЕ ВебКлиент Тогда
		ИмяКомпьютера = ИмяКомпьютера();	
		ВыполнитьСкрипты(ИмяКомпьютера);
		СформироватьСписокВыбораПринтеров();	
	#Иначе
		Элементы.ИмяПринтера.Видимость = Ложь;
	#КонецЕсли	

КонецПроцедуры

&НаСервере
Процедура СформироватьСписокВыбораПринтеров()
	ТабПринтеры = РеквизитФормыВЗначение("Принтеры",Тип("ТаблицаЗначений"));
	ТабПринтеры.Сортировать("ПоУмолчанию Убыв");
	Элементы.ИмяПринтера.СписокВыбора.ЗагрузитьЗначения(ТабПринтеры.ВыгрузитьКолонку("ИмяПринтера"));
	
	Если ТабПринтеры.Количество() > 0 Тогда
		ИмяПринтера = ТабПринтеры[0].ИмяПринтера;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПринтеров(Принтер,ПоУмолчанию)
	ТабПринтеры = РеквизитФормыВЗначение("Принтеры",Тип("ТаблицаЗначений"));
	
	стр = ТабПринтеры.Добавить();
	стр.ИмяПринтера = Принтер;
	стр.ПоУмолчанию = ПоУмолчанию;
		
	ЗначениеВРеквизитФормы(ТабПринтеры,"Принтеры");	
КонецПроцедуры


