
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийСезон = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();

	Если ТекущийСезон.Пустая() Тогда
		ТекстСообщения = "Сезон охоты не открыт";
		Поле = "Объект.СезонОхоты";
		ОхотаСервер.ПоказатьСообщение(ТекстСообщения,Поле);
		Отказ = Истина;
		Возврат;
	ИначеЕсли Объект.СезонОхоты.Пустая() Тогда
		Объект.СезонОхоты = ТекущийСезон;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ИмяМакета = Команда.Имя;
		
	ОткрытьФормуПечати(ИмяМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПечати(ИмяМакета)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ИмяМакета",ИмяМакета);
	ПараметрыПечати.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыПечати,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры
