
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ЭтоГоловноеПредприятие Тогда
		Элементы.РегиональнаяОрганизация.Видимость = Ложь;
	КонецЕсли;	
	
	ЭтоПолноправныйПользователь = ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава();
	
	Если ЭтоПолноправныйПользователь Тогда
		Возврат;
	КонецЕсли;
	
	ОснОрганизация = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация");
	
	Охотхозяйство = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОрганизация);
	
	
	Если Объект.ЭтоГоловноеПредприятие Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нарушение прав доступа");
		Отказ = Истина;
		Возврат;
	Иначе
		Если НЕ Объект.РегиональнаяОрганизация.Пустая() Тогда 
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
