
&НаКлиенте
Процедура НайтиНекорректных(Команда)
	НайтиНаСервере();
КонецПроцедуры

Процедура НайтиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОхотничьиБилеты.Охотник КАК Охотник,
	|	ОхотничьиБилеты.Охотник.ЧленОООР КАК ЧленОООР,
	|	ОхотничьиБилеты.Серия,
	|	ОхотничьиБилеты.Номер,
	|	ОхотничьиБилеты.ЗарегистрированВ,
	|	ОхотничьиБилеты.КемВыдан
	|ИЗ
	|	РегистрСведений.ОхотничьиБилеты.СрезПоследних(
	|			,
	|			НЕ Охотник.ЧленОООР
	|				И ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет)
	|				И Действует) КАК ОхотничьиБилеты";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Все данные охотников корректны");
		Возврат;
	КонецЕсли;	
	
	ТабНекорректные = РеквизитФормыВЗначение("НекорректныеДанные");
	ТабНекорректные.Очистить();
	ТабНекорректные = Результат.Выгрузить();
	ЗначениеВРеквизитФормы(ТабНекорректные,"НекорректныеДанные");
	
КонецПроцедуры	

&НаКлиенте
Процедура Скорректировать(Команда)
	СкорректироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СкорректироватьНаСервере()
	
	КоличествоЭлементов = НекорректныеДанные.Количество();
	
	Итераций = Цел(КоличествоЭлементов / 1000) + 1;
	
	ТабНекорректные = РеквизитФормыВЗначение("НекорректныеДанные");
	
	ТекущаяТаблица = ТабНекорректные.СкопироватьКолонки("Охотник");
	
	ПолучитьТысячу = Ложь;
	
	инд = 1;
	
	Для шаг = 1 по Итераций Цикл
		НачатьТранзакцию();
		
		Если шаг <> Итераций Тогда
			ПолучитьТысячу = Истина;
		КонецЕсли;
		
		ТекущаяТаблица.Очистить();
		
		Пока инд <= КоличествоЭлементов Цикл
			
			ЗаполнитьЗначенияСвойств(ТекущаяТаблица.Добавить(),ТабНекорректные[инд - 1]);
			
			Если ПолучитьТысячу 
				И Цел(инд /1000) = инд / 1000 Тогда	
				инд = инд + 1;	
				Прервать;
			КонецЕсли;	
							
			инд = инд + 1;	
		КонецЦикла;		
			
		Блокировка = Новый БлокировкаДанных;
		ЭлБлок = Блокировка.Добавить("Справочник.Охотники");
		ЭлБлок.Режим = РежимБлокировкиДанных.Исключительный;
		элБлок.ИсточникДанных = ТекущаяТаблица;
		элБлок.ИспользоватьИзИсточникаДанных("Ссылка","Охотник");
		Попытка
			Блокировка.Заблокировать();
		Исключение
			Продолжить;	
		КонецПопытки;
			
		Для каждого элОхотника Из ТекущаяТаблица Цикл
			ОбъектОхотник = элОхотника.Охотник.ПолучитьОбъект();
			Попытка
				ОбъектОхотник.ОбменДанными.Загрузка = Истина;
				ОбъектОхотник.Записать();
			Исключение
				Продолжить;
			КонецПопытки;
			
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();	
	КонецЦикла;	
	
	НайтиНаСервере();
	
КонецПроцедуры