
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ПараметрыИзменения = Новый Структура;
	ПараметрыИзменения.Вставить("Разрешение",Элемент.ТекущаяСтрока);
	ОбновитьВПодчиненномДокументе(ПараметрыИзменения);
	
	Если ПараметрыИзменения.Свойство("Путевка") Тогда
		ОповеститьОбИзменении(ПараметрыИзменения.Путевка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВПодчиненномДокументе(ПараметрыИзменения)
	Разрешение = ПараметрыИзменения.Разрешение;
	Если ЗначениеЗаполнено(Разрешение) Тогда
		Если Разрешение.ПолучитьОбъект() = Неопределено Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Путевка = ОхотаСервер.НайтиПодчиненнуюПутевку(Разрешение);	
	
	Если Путевка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Разрешение.ПометкаУдаления = Путевка.ПометкаУдаления Тогда
		Возврат;
	Иначе
		Попытка
			ПутевкаОбъект = Путевка.ПолучитьОбъект();
			ПутевкаОбъект.УстановитьПометкуУдаления(Разрешение.ПометкаУдаления);
		Исключение
			ТекстОшибки = ОбщегоНазначения.СформироватьТекстСообщения(ОписаниеОшибки());
			ОбщегоНазначения.СформироватьЗаписьЖурналаРегистрации("Изменение пометки удаления",УровеньЖурналаРегистрации.Ошибка,Путевка.Метаданные(),Путевка,ТекстОшибки);		
		КонецПопытки;
		ПараметрыИзменения.Вставить("Путевка",ПутевкаОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОхотаСервер.УстановитьОтборДинамическогоСписка(Список);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УО = Список.УсловноеОформление.Элементы;
	
	ЭлементУО1 = УО.Добавить();
	ЭлементУО2 = УО.Добавить();
	ЭлементУО3 = УО.Добавить();

	ЭлементУО1.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЦветМорскойВолныНейтральный);
	ЭлементУО2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоСерый);
	ЭлементУО3.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ХакиТемный);

	
	ЭлементУсловия = ЭлементУО1.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сдан");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ЭлементУсловия = ЭлементУО2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БезПроверки");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ЭлементУсловия = ЭлементУО2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сдан");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;
	
	ЭлементУсловия = ЭлементУО3.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АктМПР");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ЭлементУсловия = ЭлементУО2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АктМПР");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;


КонецПроцедуры


&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	Оповестить("УдалениеРазрешения");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ПолучитьРеквизитДокумента(ВыбраннаяСтрока,"Сдан")Или ПолучитьРеквизитДокумента(ВыбраннаяСтрока,"АктМПР")  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ сдан. Редактирование запрещено!",ВыбраннаяСтрока);
		Если НЕ ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава() Тогда
			СтандартнаяОбработка = Ложь;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитДокумента(Документ,Реквизит)
	Возврат	Документ[Реквизит];
КонецФункции




