
Процедура ПолучитьТабДок(ТабДок, ТабДокДляПечати,ПараметрыПечати) Экспорт
	
	Макет 			= Документы.УстановкаКвотНаОхотхозяйство.ПолучитьМакет(ПараметрыПечати.ИмяМакета);
	МакетДляПечати 	= Документы.УстановкаКвотНаОхотхозяйство.ПолучитьМакет(ПараметрыПечати.ИмяМакета + "ДляПечати");
	Ссылка 			= ПараметрыПечати.Документ;
	
	
	
Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.НомерСтроки КАК Номер,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.ВидДичи,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.КоличествоСвоим КАК Свои,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.КоличествоЧужим КАК Чужие,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.ОбщееКоличество КАК Общее,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.Ссылка.СезонОхоты КАК СезонОхоты,
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.Ссылка.Охотхозяйство КАК Охотхозяйство
	    |ИЗ
	    |	Документ.УстановкаКвотНаОхотхозяйство.СоставДичи КАК УстановкаКвотНаОхотхозяйствоСоставДичи
	    |ГДЕ
	    |	УстановкаКвотНаОхотхозяйствоСоставДичи.Ссылка В(&Ссылка)
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	Номер";

	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("СезонОхоты",Ссылка.СезонОхоты);
	Запрос.Параметры.Вставить("Охотхозяйство",Ссылка.Охотхозяйство);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОбластьКвоты			= Макет.ПолучитьОбласть("Квоты");
	ТабДок.Очистить();
	
	ОбластьКвотыДляПечати 	= МакетДляПечати.ПолучитьОбласть("Квоты");
	ТабДокДляПечати.Очистить();
	    а = 1;
		СтруктураПараметров = Новый Структура;
		Пока Выборка.Следующий() Цикл
			ОбластьКвоты.Параметры.Заполнить(Выборка);
			ОбластьКвотыДляПечати.Параметры.Заполнить(Выборка);
			
			СтруктураПараметров.Вставить("Номер" + Строка(а),а );
					
			СтруктураПараметров.Вставить("ВидДичи" + Строка(а),Выборка.ВидДичи);
			СтруктураПараметров.Вставить("Свои" + Строка(а),Выборка.Свои);
			СтруктураПараметров.Вставить("Чужие" + Строка(а),Выборка.Чужие);
			СтруктураПараметров.Вставить("Общее" + Строка(а),Выборка.Общее);
			
			а = а + 1; 	

		КонецЦикла;
		ОбластьКвоты.Параметры.Заполнить(СтруктураПараметров);
		ОбластьКвотыДляПечати.Параметры.Заполнить(СтруктураПараметров);

		
		
	ТабДок.Вывести(ОбластьКвоты);
	
	ТабДок.ПолеСверху 		= 0;
	ТабДок.ПолеСнизу 		= 0;
	ТабДок.ПолеСлева 		= 0;
	ТабДок.ПолеСправа 		= 0;
	
	ТабДокДляПечати.Вывести(ОбластьКвотыДляПечати);
	ТабДокДляПечати.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокДляПечати.ПолеСверху 	= 0;
	ТабДокДляПечати.ПолеСнизу 	= 0;
	ТабДокДляПечати.ПолеСлева 	= 0;
	ТабДокДляПечати.ПолеСправа 	= 0;

	
КонецПроцедуры




