
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОбщиеКвотыНаОхотхозяйство.Очистить();
	Движения.ОбщиеКвотыНаОхотхозяйство.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаКвот.ВидДичи,
		|	УстановкаКвот.ОбщееКоличество КАК Количество,
		|	УстановкаКвот.Ссылка.СезонОхоты,
		|	УстановкаКвот.Ссылка.Охотхозяйство,
		|	НАЧАЛОПЕРИОДА(УстановкаКвот.Ссылка.Дата, ДЕНЬ) КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	УстановкаКвот.КоличествоСвоим,
		|	УстановкаКвот.КоличествоЧужим
		|ИЗ
		|	Документ.УстановкаКвотНаОхотхозяйство.СоставДичи КАК УстановкаКвот
		|ГДЕ
		|	УстановкаКвот.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ИсходныйРезультат = Запрос.Выполнить().Выгрузить();
	
	Результат = ИсходныйРезультат.Скопировать();
	ГоловноеПредприятие = ОхотаВызовСервера.ПолучитьГоловноеПредприятие();
	Если ГоловноеПредприятие.Пустая() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлено головное предприятие. Обратитесь к администратору");
		Возврат;
	КонецЕсли;	
	
	Результат.ЗаполнитьЗначения(ГоловноеПредприятие,"Охотхозяйство");
	Движения.ОбщиеКвотыНаОхотхозяйство.Загрузить(Результат);
		
	ИсходныйРезультат.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход,"ВидДвижения");
	Движения.КвотыОхотхозяйства.Очистить();
	Движения.КвотыОхотхозяйства.Записывать = Истина;

	Движения.КвотыОхотхозяйства.Загрузить(ИсходныйРезультат);
	
	Движения.Записать();
	
	//////////////////////////////////////////////
	//Проверим минус
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КвотыОхотхозяйства.КоличествоСвоимОстаток,
		|	КвотыОхотхозяйства.КоличествоЧужимОстаток,
		|	КвотыОхотхозяйства.ВидДичи.Представление КАК ВидДичи
		|ИЗ
		|	РегистрНакопления.КвотыОхотхозяйства.Остатки(
		|			&Период,
		|			СезонОхоты = &СезонОхоты
		|				И Охотхозяйство = &Охотхозяйство) КАК КвотыОхотхозяйства
		|ГДЕ
		|	(КвотыОхотхозяйства.КоличествоСвоимОстаток < 0
		|			ИЛИ КвотыОхотхозяйства.КоличествоЧужимОстаток < 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбщиеКвотыНаОхотхозяйствоОстатки.ВидДичи.Представление КАК ВидДичи,
		|	ОбщиеКвотыНаОхотхозяйствоОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОбщиеКвотыНаОхотхозяйство.Остатки(&Период, СезонОхоты = &СезонОхоты) КАК ОбщиеКвотыНаОхотхозяйствоОстатки
		|ГДЕ
		|	ОбщиеКвотыНаОхотхозяйствоОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("СезонОхоты", СезонОхоты);
	Запрос.УстановитьПараметр("Охотхозяйство", Охотхозяйство);
	Запрос.УстановитьПараметр("Период", '00010101');
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаОбщиеКвоты = ПакетЗапросов[1].Выбрать();
	
	Пока ВыборкаОбщиеКвоты.Следующий() Цикл
		Отказ = Истина;
		Текст = "По виду дичи " +  ВыборкаОбщиеКвоты.ВидДичи +  " не хватает общих квот на "+ -ВыборкаОбщиеКвоты.КоличествоОстаток;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = ПакетЗапросов[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоСвоимОстаток < 0 Тогда
			Отказ = Истина;
			Текст = "Выдано разрешений" +  Выборка.ВидДичи +  """своим на """+ -Выборка.КоличествоСвоимОстаток + " больше, чем пытаетесь записать";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		ИначеЕсли Выборка.КоличествоЧужимОстаток < 0 Тогда
			Отказ = Истина;
			Текст = "Выдано разрешений" +  Выборка.ВидДичи +  """чужим на """+ -Выборка.КоличествоЧужимОстаток + " больше, чем пытаетесь записать";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры



