
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОбщиеКвотыНаОхотхозяйство.Очистить();
	Движения.ОбщиеКвотыНаОхотхозяйство.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаОбщихКвотСоставДичи.Ссылка.СезонОхоты.ДатаНачала КАК Период,
		|	УстановкаОбщихКвотСоставДичи.Ссылка.Охотхозяйство,
		|	УстановкаОбщихКвотСоставДичи.ВидДичи,
		|	УстановкаОбщихКвотСоставДичи.ОбщееКоличество КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	УстановкаОбщихКвотСоставДичи.Ссылка.СезонОхоты
		|ИЗ
		|	Документ.УстановкаОбщихКвот.СоставДичи КАК УстановкаОбщихКвотСоставДичи
		|ГДЕ
		|	УстановкаОбщихКвотСоставДичи.Ссылка = &Ссылка";

	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Движения.ОбщиеКвотыНаОхотхозяйство.Загрузить(Результат.Выгрузить());
		Движения.Записать();
		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОбщиеКвотыНаОхотхозяйствоОстатки.ВидДичи.Представление КАК ВидДичи,
			|	ОбщиеКвотыНаОхотхозяйствоОстатки.КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ОбщиеКвотыНаОхотхозяйство.Остатки(&Период, СезонОхоты = &СезонОхоты) КАК ОбщиеКвотыНаОхотхозяйствоОстатки
			|ГДЕ
			|	ОбщиеКвотыНаОхотхозяйствоОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("Период", '00010101');
		Запрос.УстановитьПараметр("СезонОхоты", СезонОхоты);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		Иначе
			Выборка = Результат.Выбрать();
		    Отказ = Истина;
			Пока Выборка.Следующий() Цикл
				Текст = "По виду дичи " + Выборка.ВидДичи + " отрицательный остаток в количестве " + Выборка.КоличествоОстаток;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текст");
			КонецЦикла;	
		КонецЕсли;
			
	КонецЕсли;	
КонецПроцедуры
