

Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Охотхозяйства.Ссылка.Представление КАК ГоловноеПредприятие
		|ИЗ
		|	Справочник.Охотхозяйства КАК Охотхозяйства
		|ГДЕ
		|	НЕ Охотхозяйства.ПометкаУдаления
		|	И Охотхозяйства.ЭтоГоловноеПредприятие
		|	И Охотхозяйства.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЭтоГоловноеПредприятие И НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
	    Выборка.Следующий();
		ЭтотОбъект.ЭтоГоловноеПредприятие = Ложь;
		
	КонецЕсли;	
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Головное предприятие " + Выборка.ГоловноеПредприятие + " уже существует");	
		ЭтотОбъект.ЭтоГоловноеПредприятие = Ложь;
	Иначе
		Если ЭтоГоловноеПредприятие Тогда
			УстановленнаяКонстанта = Константы.ГоловноеПредприятие.Получить();
			Если УстановленнаяКонстанта = Ссылка Тогда
				Возврат;
			Иначе
				УстановитьПривилегированныйРежим(Истина);
				Менеджер = Константы.ГоловноеПредприятие.СоздатьМенеджерЗначения();
				Менеджер.Значение = Ссылка;
				Попытка 
					Менеджер.Записать();
				Исключение
					Отказ = Истина;	
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить значение в константу. Попробуйте снова.");	
				КонецПопытки;
				
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ РегиональнаяОрганизация.Пустая() Тогда
		ПроверяемыеРеквизиты.Добавить("ИНН");
		ПроверяемыеРеквизиты.Добавить("НаименованиеПолное");
		ПроверяемыеРеквизиты.Добавить("СубъекиРФ");
	КонецЕсли;	
КонецПроцедуры

