
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ФорматДичи и ЭтотОбъект.ФорматОтчета Тогда
			ИмяГруппировки = "ТО";
	ИначеЕсли  НЕ ЭтотОбъект.ФорматДичи и ЭтотОбъект.ФорматОтчета Тогда
			ИмяГруппировки = "ДО";
	ИначеЕсли НЕ ЭтотОбъект.ФорматОтчета и ЭтотОбъект.ФорматДичи Тогда
			 ИмяГруппировки = "ТП";
	Иначе
			 ИмяГруппировки = "ДП";
	КонецЕсли;	
		
	Для Каждого ГруппировкаСКД Из КомпоновщикНастроек.Настройки.Структура Цикл
			ГруппировкаСКД.Использование = ?(ГруппировкаСКД.Имя = ИмяГруппировки, Истина, Ложь);
	КонецЦикла;

	Охотхозяйство = ЭтотОбъект.ОсновнаяОрганизация;
	Если НЕ Охотхозяйство.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОхотхозяйствоПользователя",Охотхозяйство);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОхотхозяйствоПользователя").Использование =Ложь;
	КонецЕсли;	
	
	МестоОхоты = ЭтотОбъект.МестоОхоты;
	Если НЕ МестоОхоты.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МестоОхоты",МестоОхоты);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("МестоОхоты").Использование =Ложь;
	КонецЕсли;	
	
	ВидДичи = ЭтотОбъект.ВидДичи;
	Если НЕ ВидДичи.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидДичи",ВидДичи);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидДичи")).Использование =Ложь;
	КонецЕсли;	


	ПериодОтчета = ЭтотОбъект.ПериодОтчета;
	Если ЗначениеЗаполнено(ПериодОтчета) Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",ПериодОтчета);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Использование =Ложь;
	КонецЕсли;	

	ОхотаСервер.ЗаполнитьЗаголовокОтчета(ЭтотОбъект);
	
КонецПроцедуры
