

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Путевка = ОхотаСервер.НайтиПодчиненнуюПутевку(ДокументОснование.Ссылка);
	
	Если ЗначениеЗаполнено(Путевка)
		И Путевка.Ссылка <> Ссылка Тогда
		
		ТекстСообщения = НСтр(
			"ru = 'Для документа ""%Ссылка%"" 
			|уже введена путевка ""%Путевка%"".
			|Запись еще одного документа ""Путевка"" не допускается!'"
		);
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ДокументОснование.Ссылка);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Путевка%", Путевка);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;

	
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РазрешениеНаОхоту") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Проведен,Ссылка,Номер,Ответственный");
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПродажаПутевок.Очистить();
	Движения.ПродажаПутевок.Записывать = Истина;
	
	Движение = Движения.ПродажаПутевок.Добавить();
	Движение.Период = Дата;
	Движение.СезонОхоты = СезонОхоты;
	Движение.Охотхозяйство = Охотхозяйство;
	Движение.МестоОхоты = МестоОхоты;
	Движение.ВидДичи = ВидДичи;
	Движение.ОтчетныйВидДичи = ВидДичи.ОтчетныйВидДичи;
	Движение.Сумма = Стоимость;
	Движение.Исполнитель = Ответственный;
	Движение.Серия = СерияПутевки;
	Движение.Номер = НомерПутевки;
	Движение.ПериодОхоты = "с " + Формат(ДатаНачала,"ДФ = 'дд.ММ.гггг'") + " по " + Формат(ДатаОкончания,"ДФ = 'дд.ММ.гггг'");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ПРЕДСТАВЛЕНИЕ(РазрешениеНаОхоту.Ссылка) КАК Разрешение
	//	|ИЗ
	//	|	Документ.РазрешениеНаОхоту КАК РазрешениеНаОхоту
	//	|ГДЕ
	//	|	РазрешениеНаОхоту.ПутевкаДоговор = &ПутевкаДоговор
	//	|	И РазрешениеНаОхоту.Проведен";
	//
	//Запрос.УстановитьПараметр("ПутевкаДоговор", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Если Выборка.Количество() > 1 Тогда
	//	Отказ = Истина;
	//	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры





