
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СезонОхоты = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	
	Если СезонОхоты.Пустая() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлен сезон охоты.");
		Возврат;
	Иначе	
		Список.Параметры.УстановитьЗначениеПараметра("СезонОхоты",СезонОхоты);
	КонецЕсли;	
	
	Если НЕ ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава() Тогда
		Охотхозяйство = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация"));
		Если Охотхозяйство.Пустая() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя не установлено основное охотхозяйство.");
			Возврат;
		КонецЕсли;	
		
		Список.Параметры.УстановитьЗначениеПараметра("ОхотхозяйствоПользователя",Охотхозяйство);
	КонецЕсли;	
	
КонецПроцедуры

//&НаКлиенте
//Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
//	Оповестить("ВыборРазрешения",Значение,ЭтаФорма);
//КонецПроцедуры

