
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Дата = '00010101' Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	ТекущийСезон = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	
	Если ТекущийСезон.Пустая() Тогда
		ТекстСообщения = "Сезон охоты не открыт";
		Поле = "Объект.СезонОхоты";
		ОхотаСервер.ПоказатьСообщение(ТекстСообщения,Поле);
		Отказ = Истина;
		Возврат;
	ИначеЕсли Объект.СезонОхоты.Пустая() Тогда
		Объект.СезонОхоты = ТекущийСезон;
	КонецЕсли;
	
	Если НЕ ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава() Тогда
		Элементы.СоставДичи.ИзменятьСоставСтрок =Ложь;
	КонецЕсли;	
	
	Если Объект.Ссылка.Пустая() Тогда
		ОснОтветственный = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный");
		Объект.Ответственный = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОтветственный);
		Если Объект.Ответственный.Пустая() Тогда
			
		КонецЕсли;	
		
		ОснОрганизация = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация");
		Объект.Охотхозяйство = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОрганизация);
		
		
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	ПараметрыВыбораПоСубъекту = ОхотаСерверПовтИсп.ПолучитьПараметрыВыбораПоСубъектуРФ();
	Элементы.Охотхозяйство.ПараметрыВыбора = ПараметрыВыбораПоСубъекту;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоказатьНаСервере(Текст,Поле)
	ОхотаСервер.ПоказатьСообщение(Текст,Поле);	
КонецПроцедуры

&НаКлиенте
Процедура СоставДичиКоличествоСвоимПриИзменении(Элемент)
	ТекДанные = Элементы.СоставДичи.ТекущиеДанные;
	Если ТекДанные.КоличествоСвоим + ТекДанные.КоличествоЧужим > ТекДанные.ОбщееКоличество Тогда
		Текст = "Общее количество больше установленного";
		ПоказатьНаСервере(Текст,"СоставДичи");
		ТекДанные.КоличествоСвоим = ТекДанные.ОбщееКоличество - ТекДанные.КоличествоЧужим;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставДичиКоличествоЧужимПриИзменении(Элемент)
	ТекДанные = Элементы.СоставДичи.ТекущиеДанные;
	Если ТекДанные.КоличествоСвоим + ТекДанные.КоличествоЧужим > ТекДанные.ОбщееКоличество Тогда
		Текст = "Общее количество больше установленного";
		ПоказатьНаСервере(Текст,"СоставДичи");
		ТекДанные.КоличествоЧужим = ТекДанные.ОбщееКоличество - ТекДанные.КоличествоСвоим;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставДичиПриАктивизацииСтроки(Элемент)
	
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
		ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаФормы") Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
	КонецЕсли;	
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщееКоличество = ТекущиеДанные.ОбщееКоличество;
	
	Элементы.СоставДичиКоличествоСвоим.МаксимальноеЗначение = ОбщееКоличество;
	Элементы.СоставДичиКоличествоЧужим.МаксимальноеЗначение = ОбщееКоличество;
КонецПроцедуры

&НаКлиенте
Процедура ОхотхозяйствоОчистка(Элемент, СтандартнаяОбработка)
	Если Объект.СоставДичи.Количество() > 0 Тогда
				
		СтандартнаяОбработка = Ложь;

		Описание = Новый ОписаниеОповещения("ОхотхозяйствоОчисткаЗавершение",ЭтаФорма,Неопределено);
		ПоказатьВопрос(Описание,"Таблица состав дичи будет очищена.", РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОхотхозяйствоОчисткаЗавершение(Результат, ДопПараметр) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Объект.СоставДичи.Очистить();
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОхотхозяйствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Охотхозяйство = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.СоставДичи.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыВыбораОрганизации = Новый Структура("ПредыдущееЗначение,ВыбранноеЗначение",Объект.Охотхозяйство,ВыбранноеЗначение);
		Описание = Новый ОписаниеОповещения("ИзмененияОрганизацииЗавершение",ЭтаФорма,ПараметрыВыбораОрганизации);
		ПоказатьВопрос(Описание,"Изменилась организация. Очистить таблицу?."
		,РежимДиалогаВопрос.ДаНет,60, КодВозвратаДиалога.Нет);
	КонецЕсли;							
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияОрганизацииЗавершение(РезультатВопроса,ПараметрыВыбораОрганизации)  Экспорт
	Объект.Охотхозяйство = ПараметрыВыбораОрганизации.ВыбранноеЗначение;
	
	Если  РезультатВопроса = КодВозвратаДиалога.Да Тогда
	
		Объект.СоставДичи.Очистить();
	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОхотхозяйствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава() Тогда
		СтандартнаяОбработка = Ложь;
		ОснОрганизация = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация");
		Охотхозяйство = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОрганизация);
		Если Охотхозяйство.Пустая() Тогда
			Описание = Новый ОписаниеОповещения("ОхотхозяйствоНачалоВыбораЗавершение",ЭтаФорма);
			ПоказатьПредупреждение(Описание,"У текущего пользователя не определена основная организация. Работа не возможна.",10,"Не определена основная организация");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоставДичиОбщееКоличествоПриИзменении(Элемент)
	СоставДичиПриАктивизацииСтроки(Элемент);
	ТекДанные = Элементы.СоставДичи.ТекущиеДанные;
	
	КоличествоСвоим = ТекДанные.ОбщееКоличество - ТекДанные.КоличествоЧужим;
		
	Если КоличествоСвоим <=0 Тогда
		ТекДанные.КоличествоЧужим = 0;
		ТекДанные.КоличествоСвоим = ТекДанные.ОбщееКоличество;
	Иначе
		ТекДанные.КоличествоСвоим = КоличествоСвоим;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсех(Команда)
	ВсеВидыДичи = ОхотаВызовСервера.ПолучитьВсеВидыДичи(Объект.СезонОхоты);
	
	Если Объект.СоставДичи.Количество() > 0 Тогда
		Описание = Новый ОписаниеОповещения("ДобавитьВсехЗавершение",ЭтаФорма,ВсеВидыДичи);	
		ПоказатьВопрос(Описание,"Табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
	Иначе
		Для каждого стр из ВсеВидыДичи Цикл
			Объект.СоставДичи.Добавить().ВидДичи = стр;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсехЗавершение(Ответ,ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.СоставДичи.Очистить();
		Для каждого стр из ДопПараметры Цикл
			Объект.СоставДичи.Добавить().ВидДичи = стр;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура Печать(Команда)
	ИмяМакета = Команда.Имя;
		
	ОткрытьФормуПечати(ИмяМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПечати(ИмяМакета)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ИмяМакета",ИмяМакета);
	ПараметрыПечати.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыПечати,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры
