
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ЧленскийБилет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет");
	
	Если ЭтотОбъект.Отбор.ВидБилета.Значение = ЧленскийБилет Тогда
		ПроверяемыеРеквизиты.Добавить("КемВыдан");
	КонецЕсли;	
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		Если НЕ ЭтотОбъект.Отбор.Действует.Значение Тогда
			Возврат;
		КонецЕсли;	
		
		ВидБилета = ЭтотОбъект.Отбор.ВидБилета.Значение;
		Охотник = ЭтотОбъект.Отбор.Охотник.Значение;
		Исключен = ЭтотОбъект.Отбор.Исключен.Значение;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(ОхотничьиБилеты.Действует) КАК КоличествоДействующих,
			|	МАКСИМУМ(ОхотничьиБилеты.Исключен) КАК Исключен
			|ИЗ
			|	РегистрСведений.ОхотничьиБилеты КАК ОхотничьиБилеты
			|ГДЕ
			|	ОхотничьиБилеты.Охотник = &Охотник
			|	И ОхотничьиБилеты.ВидБилета = &ВидБилета
			|	И ОхотничьиБилеты.Действует = ИСТИНА
		    |   И  ОхотничьиБилеты.Исключен = &Исключен";
		Запрос.УстановитьПараметр("ВидБилета", ВидБилета);
		Запрос.УстановитьПараметр("Охотник", Охотник);
		Запрос.УстановитьПараметр("Исключен", Исключен);

		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.КоличествоДействующих > 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать два и более действующих билета",,,,Отказ);				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры







