
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	Пользователь = Неопределено;
//	Если Параметры.Свойство("Пользователь",Пользователь) Тогда
//		
//		
//		Если ЗначениеЗаполнено(Пользователь) Тогда
//			
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	НастройкиПользователей.Значение,
//			|	ПВХНастройки.Ссылка КАК Настройка,
//			|	ПВХНастройки.Представление КАК НастройкаПредставление,
//			|	ПВХНастройки.ТипЗначения
//			|ИЗ
//			|	ПланВидовХарактеристик.НастройкиПользователей КАК ПВХНастройки
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
//			|		ПО ПВХНастройки.Ссылка = НастройкиПользователей.Настройка
//			|			И (НастройкиПользователей.Пользователь = &Пользователь)
//			|			И (ПВХНастройки.Предопределенный)";
//		
//		Запрос.УстановитьПараметр("Пользователь", Пользователь);
//	
//	ТЗ = Запрос.Выполнить().Выгрузить();
//	
//	НастройкиЗначение = РеквизитФормыВЗначение("НастройкиПользователя",Тип("ТаблицаЗначений"));
//	
//	Для Каждого стр из ТЗ Цикл
//		стрЗ = НастройкиЗначение.Добавить();
//		ЗаполнитьЗначенияСвойств(стрЗ,стр);
//	КОнецЦикла;
//	
//	
//	ЗначениеВРеквизитФормы(НастройкиЗначение,"НастройкиПользователя");
//	
//	КонецЕсли;
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	Для каждого стр из НастройкиПользователя Цикл
//		Элементы.НастройкиПользователяЗначение.ОграничениеТипа(ТипЗнч(стр.Настройка))
//	КонецЦикла
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Реквизит1ПередНачаломИзменения(Элемент, Отказ)
//	
//	Если Элемент.ТекущиеДанные = Неопределено  Тогда
//		Отказ = Истина;
//		Возврат;
//	ИначеЕсли Элемент.ТекущиеДанные.Настройка = ОсновноеПодразделение Тогда
//		
//		НовыйМассив = Новый Массив();
//		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", ПараметрыВыбораПодразделение));
//		Элементы.ДеревоНастроекЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);;
//		
//	ИначеЕсли Элемент.ТекущиеДанные.Настройка = ОсновнойСклад Тогда
//		
//		НовыйМассив = Новый Массив();
//		Для каждого ЭлементСписка Из ПараметрыВыбораСклад Цикл
//			НовыйМассив.Добавить(ЭлементСписка.Значение);
//		КонецЦикла;		
//		МассивСклад = Новый ФиксированныйМассив(НовыйМассив);
//		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивСклад);
//		НовыйМассив = Новый Массив();
//		НовыйМассив.Добавить(НовыйПараметр);
//		Элементы.ДеревоНастроекЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
//		
//	КонецЕсли;

//КонецПроцедуры
