
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Ограничение.Очистить();
	Движения.Ограничение.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	  "ВЫБРАТЬ
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Ссылка.СезонОхоты.ДатаНачала КАК Период,
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Охотхозяйство.Ссылка КАК Охотхозяйство,
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Ссылка.СезонОхоты.Ссылка КАК СезонОхоты,
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Дичь
	 |ИЗ
	 |	Документ.УстановкаНеучтеннойДичи.НеучтеннаяДичь КАК УстановкаНеучтеннойДичиНеучтеннаяДичь
	 |ГДЕ
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Движения.Ограничение.Загрузить(Результат.Выгрузить());
		Движения.Записать();
	КонецЕсли;

КонецПроцедуры
