

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Заявление = ОхотаСервер.НайтиПодчиненноеЗаявление(ДокументОснование.Ссылка);
	
	Если ЗначениеЗаполнено(Заявление)
		И Заявление.Ссылка <> Ссылка Тогда
		
		ТекстСообщения = НСтр(
			"ru = 'Для документа ""%Ссылка%"" 
			|уже введена путевка ""%Заявление%"".
			|Запись еще одного документа ""Заявление"" не допускается!'"
		);
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ДокументОснование.Ссылка);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Заявление%", Заявление);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;

	
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РазрешениеНаОхоту") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Проведен,Ссылка,Номер,Ответственный");
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры






