

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НовыеПараметрыВыбора = ОхотаСерверПовтИсп.ПолучитьПараметрыВыбораПоСубъектуРФ();
	Отчет.ФорматОтчета=Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для каждого эл из Элементы Цикл
		Если эл.Заголовок = "Охотхозяйство пользователя" Тогда
			Если ТипЗнч(эл)  = Тип("ГруппаФормы") Тогда
				ПодчиненныеЭл = эл.ПодчиненныеЭлементы;
				Для каждого подэл из ПодчиненныеЭл Цикл
					Если подэл.Имя = подэл.Родитель.Имя + "Значение" Тогда
						подэл.ПараметрыВыбора = НовыеПараметрыВыбора;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;				
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

