
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЦеныПоВидамДичи.Записывать = Истина;
	Движения.ЦеныПоВидамДичи.Очистить();
	Движения.ОграниченияДичиНаДобычу.Записывать = Истина;
	Движения.ОграниченияДичиНаДобычу.Очистить();

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧСостав.Дичь,
		|	ТЧСостав.ДатаНачала,
		|	ТЧСостав.ДатаОкончания,
		|	ТЧСостав.Ограничено,
		|	ТЧСостав.КоличествоВДень,
		|	ТЧСостав.КоличествоЗаСезон,
		|	ТЧОбщая.ВидДичи,
		|	ТЧСостав.НомерСтроки КАК НомерСтроки,
		|	ТЧСостав.КлючСвязи
		|ИЗ
		|	Документ.УстановкаОграниченийИЦен.Общая КАК ТЧОбщая
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаОграниченийИЦен.Состав КАК ТЧСостав
		|		ПО ТЧОбщая.КлючСвязи = ТЧСостав.КлючСвязи
		|ГДЕ
		|	ТЧОбщая.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧСостав.Дичь,
		|	ТЧСостав.ДатаНачала,
		|	ТЧСостав.ДатаОкончания,
		|	ТЧСостав.Ограничено,
		|	ТЧСостав.КоличествоВДень,
		|	ТЧСостав.КоличествоЗаСезон,
		|	ТЧОбщая.ВидДичи,
		|	ТЧСостав.НомерСтроки,
		|	ТЧСостав.КлючСвязи
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаОграниченийИЦенОбщая.ВидДичи,
		|	УстановкаОграниченийИЦенОбщая.ДатаНачала,
		|	УстановкаОграниченийИЦенОбщая.ДатаОкончания,
		|	УстановкаОграниченийИЦенОбщая.ЦенаСвоимРазовая,
		|	УстановкаОграниченийИЦенОбщая.ЦенаСвоимСезонная,
		|	УстановкаОграниченийИЦенОбщая.ЦенаЧужимРазовая,
		|	УстановкаОграниченийИЦенОбщая.ЦенаЧужимСезонная,
		|	УстановкаОграниченийИЦенОбщая.ТолькоГосБилетРазовая,
		|	УстановкаОграниченийИЦенОбщая.ТолькоГосБилетСезонная,
		|	УстановкаОграниченийИЦенОбщая.Ссылка.ЦенаШтатнымСотрудникам,
		|	УстановкаОграниченийИЦенОбщая.Ссылка.ЦенаВетеранамВойны,
		|	УстановкаОграниченийИЦенОбщая.Ссылка.ЦенаИнвалидамПервойГруппы,
		|	УстановкаОграниченийИЦенОбщая.Ссылка.ЦенаПослеВозрастногоПорога,
		|	УстановкаОграниченийИЦенОбщая.ДействиеОсобыхЦен,
		|	УстановкаОграниченийИЦенОбщая.ТолькоСезонная,
		|	УстановкаОграниченийИЦенОбщая.КлючСвязи
		|ИЗ
		|	Документ.УстановкаОграниченийИЦен.Общая КАК УстановкаОграниченийИЦенОбщая";
	
		
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаСостав = Результат[0].Выбрать();
	ВыборкаОбщая = Результат[1].Выбрать();
	
	
	Пока ВыборкаОбщая.Следующий() Цикл
		Движение = Движения.ЦеныПоВидамДичи.Добавить();
		Движение.Период 		= НачалоДня(Дата);
		Движение.СезонОхоты 	= СезонОхоты;
		Движение.Регистратор	= Ссылка;
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаОбщая);
	КонецЦикла;
	
	Пока ВыборкаСостав.Следующий() Цикл
		Движение = Движения.ОграниченияДичиНаДобычу.Добавить();
		Движение.Период 		= НачалоДня(Дата);
		Движение.СезонОхоты 	= СезонОхоты;
		Движение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаСостав);
	КонецЦикла;

	
КонецПроцедуры
