
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОхотаСервер.УстановитьОтборДинамическогоСписка(Список);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "УдалениеРазрешения" Тогда
		Элементы.Список.Обновить();
	//ИначеЕсли ИмяСобытия = "ВыборРазрешения" Тогда
	//	Если Тип(Источник) = Тип("УправляемаяФорма") Тогда
	//		//ПараметрыФормы = Новый Структура("Основание",Параметр);
	//		//ОткрытьФорму("Документ.ПутевкаДоговор.ФормаОбъекта", ПараметрыФормы);
	//		Если Открыта() Тогда
	//			Закрыть();
	//		КонецЕсли;	
	//	КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

