
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка прав доступа");
		Возврат;
	Иначе
		ОснОтветственный = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный");
		Объект.Ответственный = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ОснОтветственный);	
	КонецЕсли;	
	ТекущийСезон = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	
	Если ТекущийСезон.Пустая() Тогда
		ТекстСообщения = "Сезон охоты не открыт";
		Поле = "Объект.СезонОхоты";
		ОхотаСервер.ПоказатьСообщение(ТекстСообщения,Поле);
		Отказ = Истина;
		Возврат;
	ИначеЕсли Объект.СезонОхоты.Пустая() Тогда
		Объект.СезонОхоты = ТекущийСезон;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоставДичиВидДичиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = ПодобратьДанные();
	
	Если ДанныеВыбора.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить справочник виды дичи";
		Сообщение.Сообщить();
	Иначе
		СписокВыбора = Элементы.СоставДичиВидДичи.СписокВыбора;
		СписокВыбора.Очистить();
		
		Для каждого эл из ДанныеВыбора Цикл
			ЗаполнитьЗначенияСвойств(СписокВыбора.Добавить(),эл);
		КонецЦикла;	
		СписокВыбора.СортироватьПоПредставлению();
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Функция ПодобратьДанные()
	
	ПараметрыПодбора    =    Новый Структура("Отбор,СтрокаПоиска,ВыборГруппИЭлементов",
	Новый Структура(), 
	"",                
	ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
	
	
	ПараметрыПодбора.Вставить("ДополнительныеПараметры", Новый Структура("ВидыДичи",Объект.СоставДичи.Выгрузить(,"ВидДичи")));
	
	Возврат    ПолучитьДанныеВыбора(Тип("СправочникСсылка.ВидыДичи"), ПараметрыПодбора);
	
	
КонецФункции


