#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр по переданным параметрам
//
// СоответствиеДанных - (Соответствие) Соответствие данных, где
//
//		Ключ - (Справочник.Сотрудники) Сотрудник, который назначается пользователю;
//		Значение - (Справочник.Пользователи) Пользователь, который связывается с сотрудником
//
Процедура ДобавитьСотрудниковПользователей(СоответствиеДанных) Экспорт
	
	Для каждого ЭлементСоответствия Из СоответствиеДанных Цикл
		
		МенеджерЗаписи = РегистрыСведений.СотрудникиПользователя.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сотрудник = ЭлементСоответствия.Ключ;
		МенеджерЗаписи.Пользователь = ЭлементСоответствия.Значение;
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьСотрудникаПользователя()

#КонецОбласти

#КонецЕсли