
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СезонОхоты = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	
	Если НЕ ЭтотОбъект.ФорматОтчета Тогда
		ИмяГруппировки = "Д";
	Иначе 
		ИмяГруппировки = "Т";
	КонецЕсли;
	
	  Для Каждого ГруппировкаСКД Из КомпоновщикНастроек.Настройки.Структура Цикл
			ГруппировкаСКД.Использование = ?(ГруппировкаСКД.Имя = ИмяГруппировки, Истина, Ложь);
	КонецЦикла;

	Если НЕ СезонОхоты.Пустая() Тогда	
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СезонОхоты",СезонОхоты);
	КонецЕсли;
	
	Период = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период").Значение;
	
	Если ЗначениеЗаполнено(Период) Тогда
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Title").Значение = "Остаток квот на " + Формат(Период,"ДЛФ=DD");
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Title").Значение = "Остаток квот на " + Формат(ТекущаяДата(),"ДЛФ=DD");
	КонецЕсли;
КонецПроцедуры
