
Процедура ПолучитьТабДок(ТабДок, ТабДокДляПечати,ПараметрыПечати) Экспорт
	
	Макет 			= Справочники.Охотники.ПолучитьМакет(ПараметрыПечати.ИмяМакета);
	МакетДляПечати 	= Справочники.Охотники.ПолучитьМакет(ПараметрыПечати.ИмяМакета + "ДляПечати");
	Ссылка 			= ПараметрыПечати.Справочник;
	
	
	
Запрос = Новый Запрос;
	Запрос.Текст =
	  "ВЫБРАТЬ
	  |	ЕСТЬNULL(КонтактнаяИнформация.Город, """") КАК Город,
	  |	ЕСТЬNULL(КонтактнаяИнформация.Улица, """") КАК Улица,
	  |	ЕСТЬNULL(КонтактнаяИнформация.Дом, """") КАК Дом,
	  |	ЕСТЬNULL(КонтактнаяИнформация.Квартира, """") КАК Квартира,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ГосБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.Серия, """")
	  |		КОНЕЦ) КАК ГОССерияБилета,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ГосБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.Номер, """")
	  |		КОНЕЦ) КАК ГОСНомерБилета,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ГосБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.ДатаВыдачи, """")
	  |		КОНЕЦ) КАК ГОСДатаВыдачи,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.ЗарегистрированВ, ""Без членского билета"")
	  |		КОНЕЦ) КАК ЗарегистрированВ,
	  |	Охотники.Фамилия,
	  |	Охотники.Имя,
	  |	Охотники.Отчество,
	  |	Охотники.ДатаРождения,
	  |	Охотники.НомерТелефона КАК НомерТелефона,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.Серия, """")
	  |		КОНЕЦ) КАК ЧЛСерияБилета,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.Номер, """")
	  |		КОНЕЦ) КАК ЧЛНомерБилета,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.ДатаВыдачи, """")
	  |		КОНЕЦ) КАК ЧЛДатаВыдачи,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ЧленскийБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.КемВыдан, """")
	  |		КОНЕЦ) КАК ЧЛКемВыдан,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА ОхотничьиБилеты.ВидБилета = &ГосБилет
	  |				ТОГДА ЕСТЬNULL(ОхотничьиБилеты.КемВыдан, """")
	  |		КОНЕЦ) КАК ГОСКемВыдан
	  |ИЗ
	  |	Справочник.Охотники КАК Охотники
	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	  |		ПО Охотники.Ссылка = КонтактнаяИнформация.Охотник
	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОхотничьиБилеты КАК ОхотничьиБилеты
	  |		ПО (ОхотничьиБилеты.Действует)
	  |			И Охотники.Ссылка = ОхотничьиБилеты.Охотник
	  |ГДЕ
	  |	Охотники.Ссылка В(&Ссылка)
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	ЕСТЬNULL(КонтактнаяИнформация.Город, """"),
	  |	ЕСТЬNULL(КонтактнаяИнформация.Улица, """"),
	  |	ЕСТЬNULL(КонтактнаяИнформация.Дом, """"),
	  |	ЕСТЬNULL(КонтактнаяИнформация.Квартира, """"),
	  |	Охотники.Фамилия,
	  |	Охотники.Имя,
	  |	Охотники.Отчество,
	  |	Охотники.ДатаРождения,
	  |	Охотники.НомерТелефона"	;

			
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("ГосБилет",Перечисления.ВидыОхотничьихБилетов.ГосБилет);
	Запрос.Параметры.Вставить("ЧленскийБилет",Перечисления.ВидыОхотничьихБилетов.ЧленскийБилет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьОхотник			= Макет.ПолучитьОбласть("Охотник");
	ТабДок.Очистить();
	
	ОбластьОхотникДляПечати 	= МакетДляПечати.ПолучитьОбласть("Охотник");
	ТабДокДляПечати.Очистить();
	
	
	 
	а=1;

	СтруктураПараметров = Новый Структура;
		
	
	     Пока Выборка.Следующий() Цикл

		
		 ОбластьОхотник.Параметры.Заполнить(Выборка);
	 	 ОбластьОхотникДляПечати.Параметры.Заполнить(Выборка);
		
	
		ГОСДатаВыдачи	=  Формат(Выборка.ГОСДатаВыдачи,"ДФ = 'дд.ММ.гггг'");
		
		ЧЛДатаВыдачи 	=  Формат(Выборка.ЧЛДатаВыдачи, "ДФ = 'дд.ММ.гггг'");
	
		ДатаРождения	=  Формат(Выборка.ДатаРождения, "ДФ = 'дд.ММ.гггг'");
		
		СтруктураПараметров.Вставить("ДатаРождения",ДатаРождения);
		СтруктураПараметров.Вставить("ГОСДатаВыдачи",ГОСДатаВыдачи);
		СтруктураПараметров.Вставить("ЧЛДатаВыдачи",ЧЛДатаВыдачи);
		СтруктураПараметров.Вставить("ЧЛКемВыдан" + Строка(а),Выборка.ЧЛКемВыдан);
		СтруктураПараметров.Вставить("ЗарегистрированВ" + Строка(а),Выборка.ЗарегистрированВ);

		////////// параметры, которые не подставляются  
		СтруктураПараметров.Вставить("ГОСКемВыдан" + Строка(а),Выборка.ГОСКемВыдан);
		СтруктураПараметров.Вставить("ГОСНомерБилета" + Строка(а),Выборка.ГОСНомерБилета);
		СтруктураПараметров.Вставить("ГОССерияБилета" + Строка(а),Выборка.ГОССерияБилета);
		СтруктураПараметров.Вставить("ЧЛНомерБилета",Выборка.ЧЛНомерБилета);
		СтруктураПараметров.Вставить("ЧЛСерияБилета",Выборка.ЧЛСерияБилета);
		
		
		
		а = а + 1;
		ОбластьОхотник.Параметры.Заполнить(СтруктураПараметров);
		ОбластьОхотникДляПечати.Параметры.Заполнить(СтруктураПараметров);

	КонецЦикла;
	
		
			
	ТабДок.Вывести(ОбластьОхотник);
	
	ТабДок.ПолеСверху 		= 0;
	ТабДок.ПолеСнизу 		= 0;
	ТабДок.ПолеСлева 		= 0;
	ТабДок.ПолеСправа 		= 0;
	
	ТабДокДляПечати.Вывести(ОбластьОхотникДляПечати);
	ТабДокДляПечати.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокДляПечати.ПолеСверху 	= 0;
	ТабДокДляПечати.ПолеСнизу 	= 0;
	ТабДокДляПечати.ПолеСлева 	= 0;
	ТабДокДляПечати.ПолеСправа 	= 0;

	
КонецПроцедуры




