
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ ЧленОООР Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("Охотхозяйство");
		Если НЕ Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЧленОООР Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОхотничьиБилеты.Серия,
			|	ОхотничьиБилеты.Номер,
			|	ОхотничьиБилеты.ДатаВыдачи,
			|	ОхотничьиБилеты.ЗарегистрированВ
			|ИЗ
			|	РегистрСведений.ОхотничьиБилеты КАК ОхотничьиБилеты
			|ГДЕ
			|	ОхотничьиБилеты.Действует
			|	И ОхотничьиБилеты.ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет)
			|	И ОхотничьиБилеты.Охотник = &Охотник";
		
		Запрос.УстановитьПараметр("Охотник", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Охотник является членом охотхозяйства " + Охотхозяйство.Наименование + " и не имеет действительного билета. Запись не возможна.");
			Возврат;
		КонецЕсли;
	КонецЕсли;	

	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазрешениеНаОхоту.Ссылка
		|ИЗ
		|	Документ.РазрешениеНаОхоту КАК РазрешениеНаОхоту
		|ГДЕ
		|	РазрешениеНаОхоту.Охотник = &Охотник
		|	И РазрешениеНаОхоту.Проведен";
	
	Запрос.УстановитьПараметр("Охотник", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
	Отказ = Истина;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На данного пользователя было выписано разрешение. Удаление не возможно");
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ДанныеОхотника = ОхотаСерверПовтИсп.ПолучитьДанныеОхотника(Ссылка);
	
	Если ДанныеОхотника.ЕстьЧленскийБилет И НЕ Ссылка.ЧленОООР Тогда
		ЧленОООР = Истина;
	ИначеЕсли 	НЕ ДанныеОхотника.ЕстьЧленскийБилет И Ссылка.ЧленОООР Тогда
		ЧленОООР = Ложь;
	КонецЕсли;	
	
		
	Если ЧленОООР = Истина И Ссылка.Охотхозяйство.ЧленствоККОООР = Истина Тогда      
		ЧленККОООР = Истина;
		Иначе
		ЧленККОООР = Ложь;
	КонецЕсли;	
	
		
КонецПроцедуры

