
Процедура ПриНачалеРаботыСистемы()
	
	ПользовательАктуален = ОхотаВызовСервера.ПолучитьАктуальностьПользователя();
	
	Если Не ПользовательАктуален Тогда
		ТекстОшибки = "Пользователю информационной базы не сопоставлен элемент справочника пользователь.
						|Обратитесь к администратору";
						
		Описание = Новый ОписаниеОповещения("ПриНачалеРаботыЗавершение",ОбщегоНазначенияКлиент,Истина);				
		ПоказатьПредупреждение(Описание,ТекстОшибки,10,"Ошибка авторизации"); 
	КонецЕсли;	
	
	Если ЭтоПервыйЗапуск() Тогда
		ЗавершитьРаботуСистемы(Ложь,Истина);
	КонецЕсли;
	
	Если ОхотаСерверПовтИсп.ПолучитьФлагВыводаПредупрежденийПриНачалеРаботы() Тогда
		СписокЗадолжников = ОхотаВызовСервера.ПолучитьСписокНеСдавшихРазрешения();
		ТекстСообщения = "";
		Если СписокЗадолжников.Количество() > 0 Тогда
			Для каждого стр из СписокЗадолжников Цикл
				ТекстСообщения = ТекстСообщения + стр.Охотник + " не сдал разрешение серия " + стр.Серия + " номер " + стр.Номер + " по документу " + стр.Документ + Символы.ПС;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава() Тогда
		ОсновнаяОрганизация = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация"));	
		ОсновнойОтветственный = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнойОтветственный"));	
		СтруктураОшибок = Новый Структура;
		Если ОсновнаяОрганизация.Пустая() Тогда
			СтруктураОшибок.Вставить("ОсновнаяОрганизация");
		КонецЕсли;
		Если ОсновнойОтветственный.Пустая() Тогда
			СтруктураОшибок.Вставить("ОсновнойОтветственный");
		КонецЕсли;
		Если СтруктураОшибок.Количество() > 0 Тогда
			Описание = Новый ОписаниеОповещения("НачалоРаботыЗавершение", ОхотаКлиент,СтруктураОшибок);
			Для каждого стр из СтруктураОшибок Цикл
				Если стр.Ключ = "ОсновнаяОрганизация" Тогда
					ТекстПредупреждения = "Для пользователя не установлена основная организация"
				КонецЕсли;
				Если стр.Ключ = "ОсновнойОтветственный" Тогда
					Если НЕ ПустаяСтрока(ТекстПредупреждения) Тогда
						ТекстПредупреждения = ТекстПредупреждения + "
						|Для пользователя не установлен основной ответственный";
					Иначе
						ТекстПредупреждения = "Для пользователя не установлен основной ответственный";	
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;	
			
			
			ПоказатьПредупреждение(Описание,ТекстПредупреждения,10);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
КонецПроцедуры


Функция ЭтоПервыйЗапуск()
	Возврат ОхотаВызовСервера.ЭтоПервыйЗапуск();		
КонецФункции







