
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	СформироватьНаименованиеСотрудника();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	СформироватьНаименованиеСотрудника();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	СформироватьНаименованиеСотрудника();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеСотрудника()
	Объект.Наименование = СокрЛП(?(ПустаяСтрока(Объект.Фамилия),"",Объект.Фамилия + " ") + ?(ПустаяСтрока(Объект.Имя),"",Объект.Имя + " ") +  ?(ПустаяСтрока(Объект.Отчество),"",Объект.Отчество + " "));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("АдминистраторСистемы")) Тогда
		Отказ = Истина;
		Текст = "Недостаточно прав";
		ОхотаСервер.ПоказатьСообщение(Текст);
		Возврат;
	КонецЕсли;	
КонецПроцедуры
