
Функция ПолучитьАктуальностьПользователя() Экспорт
	Возврат ОхотаСервер.ПользовательАктуален();	
КонецФункции

Функция ЭтоПервыйЗапуск() Экспорт
		Возврат ПараметрыСеанса.ПервыйЗапуск;	
КонецФункции

Функция ПолучитьСписокНеСдавшихРазрешения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВыдачаРазрешенийОбороты.Регистратор.Охотник.Наименование, ""Неизвестный охотник"") КАК Охотник,
		|	ВыдачаРазрешенийОбороты.Регистратор.СерияРазрешения КАК Серия,
		|	ВыдачаРазрешенийОбороты.Регистратор.НомерРазрешения КАК Номер,
		|	ВыдачаРазрешенийОбороты.Регистратор.Представление КАК Документ,
		|	ЕСТЬNULL(ВыдачаРазрешенийОбороты.Регистратор.Охотник.НомерТелефона, """") КАК НомерТелефона,
		|	ЕСТЬNULL(КонтактнаяИнформация.Город, """") КАК Город,
		|	ЕСТЬNULL(КонтактнаяИнформация.Улица, """") КАК Улица,
		|	ЕСТЬNULL(КонтактнаяИнформация.Дом, """") КАК Дом,
		|	ЕСТЬNULL(КонтактнаяИнформация.Квартира, """") КАК Квартира
		|ИЗ
		|	РегистрНакопления.ВыдачаРазрешений.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Охотхозяйство = &Охотхозяйство) КАК ВыдачаРазрешенийОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ВыдачаРазрешенийОбороты.Регистратор.Охотник = КонтактнаяИнформация.Охотник
		|ГДЕ
		|	ВыдачаРазрешенийОбороты.Регистратор.Обработан
		|	И НЕ ВыдачаРазрешенийОбороты.Регистратор.Сдан
		|	И РАЗНОСТЬДАТ(ВыдачаРазрешенийОбороты.Регистратор.ДатаОкончания, &Сегодня, ДЕНЬ) > &ДнейОжиданияВозвратаРазрешения";
	
	Запрос.УстановитьПараметр("ДатаНачала", (ТекущаяДата() - 3*365*24*60*60));
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.УстановитьПараметр("ДнейОжиданияВозвратаРазрешения", Константы.ДнейОжиданияВозвратаРазрешения.Получить());
	УстановитьПривилегированныйРежим(Ложь);	
	
	
	Если РольДоступна("ПолныеПрава") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Охотхозяйство = &Охотхозяйство","");
	Иначе	
		Охотхозяйство = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация);
		Запрос.УстановитьПараметр("Охотхозяйство", Охотхозяйство);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Сегодня", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Задолжники = Новый Массив;
	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Задолжники;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Содержание = Новый Структура("Охотник,Серия,Номер,Документ,Город,Улица,Дом,Квартира,НомерТелефона");
		ЗаполнитьЗначенияСвойств(Содержание, Выборка);
		Задолжники.Добавить(Содержание);
	
	КонецЦикла;
	
	Возврат Задолжники;
		
КонецФункции

Функция ПолучитьГоловноеПредприятие() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ГоловноеПредприятине = Константы.ГоловноеПредприятие.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ГоловноеПредприятине;
КонецФункции

Функция ПолучитьВсеВидыДичи(СезонОхоты) Экспорт
	
	ВидыДичи = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщиеКвотыОстатки.ВидДичи КАК ВидДичи
		|ИЗ
		|	РегистрНакопления.ОбщиеКвотыНаОхотхозяйство.Остатки(
		|			,
		|			СезонОхоты = &СезонОхоты
		|				И Охотхозяйство = &Охотхозяйство) КАК ОбщиеКвотыОстатки";
		
	ГоловноеПредприятие = ПолучитьГоловноеПредприятие();
	
	Если ГоловноеПредприятие.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлено головное предприятие");
		Возврат ВидыДичи;
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("Охотхозяйство", ГоловноеПредприятие);
	Запрос.УстановитьПараметр("СезонОхоты", СезонОхоты);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ВидыДичи;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВидыДичи.Добавить(Выборка.ВидДичи);		
		КонецЦикла;	
		Возврат ВидыДичи;	
	КонецЕсли;
КонецФункции


Функция ПолучитьОбязательныеРеквизитыРазрешения() Экспорт
	Возврат Константы.ОбязательныеРеквизитыРазрешенияДляЕгеря.Получить().Получить();	
КонецФункции
