
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ВыдачаРазрешений.Очистить();
	Движения.КвотыОхотхозяйства.Очистить();
	
	
	Движения.ВыдачаРазрешений.Записывать = Истина;
	Движение = Движения.ВыдачаРазрешений.Добавить();
	Движение.Период = Дата;
	Движение.СезонОхоты = СезонОхоты;
	Движение.Охотхозяйство = Охотхозяйство;
	Движение.МестоОхоты = МестоОхоты;
	Движение.ВидДичи = ВидДичи;
	Движение.ОтчетныйВидДичи = ВидДичи.ОтчетныйВидДичи;
	Движение.Сумма = 0.01;
	Движение.Исполнитель = Ответственный;
	Движение.Серия = СерияРазрешения;
	Движение.Номер = НомерРазрешения;
	Движение.ПериодОхоты = "с " + Формат(ДатаНачала,"ДФ = 'дд.ММ.гггг'") + " по " + Формат(ДатаОкончания,"ДФ = 'дд.ММ.гггг'");
	
	
	Движения.КвотыОхотхозяйства.Записывать = Истина;	
	Движения.КвотыОхотхозяйства.БлокироватьДляИзменения = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&МестоОхоты КАК Охотхозяйство,
		|	ВЫБОР
		|		КОГДА &Охотхозяйство = &МестоОхоты
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоСвоим,
		|	ВЫБОР
		|		КОГДА &Охотхозяйство = &МестоОхоты
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоличествоЧужим,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.Охотник,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.МестоОхоты,
		|	РазрешениеНаОхотуДобытаяДичь.Дичь,
		|	СУММА(РазрешениеНаОхотуДобытаяДичь.Количество) КАК Количество,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.РазрешениеНаОхоту.ДобытаяДичь КАК РазрешениеНаОхотуДобытаяДичь
		|ГДЕ
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РазрешениеНаОхотуДобытаяДичь.Дичь,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.Охотник,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.МестоОхоты,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Охотник", Охотник);
	Запрос.УстановитьПараметр("Охотхозяйство", Охотхозяйство);
	Запрос.УстановитьПараметр("МестоОхоты", МестоОхоты);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	
	Движение = Движения.КвотыОхотхозяйства.Добавить();
	
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движение,Выборка);
		Движение.ВидДичи  = ВидДичи;
		Движение.СезонОхоты = СезонОхоты;
		Движение.Период = Дата;
	КонецЦикла;
	
	Движения.Записать();
	
	//////////////////////////////////////////////
	//Проверим минус
	Выборка.Сбросить();
	Выборка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &КоличествоСвоим
		|			ТОГДА КвотыОхотхозяйстваОстатки.КоличествоСвоимОстаток
		|		ИНАЧЕ КвотыОхотхозяйстваОстатки.КоличествоЧужимОстаток
		|	КОНЕЦ КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.КвотыОхотхозяйства.Остатки(
		|			&Период,
		|			СезонОхоты = &СезонОхоты
		|				И Охотхозяйство = &Охотхозяйство
		|				И ВидДичи = &ВидДичи) КАК КвотыОхотхозяйстваОстатки";
	
	Запрос.УстановитьПараметр("ВидДичи", ВидДичи);
	Запрос.УстановитьПараметр("Охотхозяйство", МестоОхоты);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СезонОхоты", СезонОхоты);
	Запрос.УстановитьПараметр("КоличествоСвоим",?(Выборка.КоличествоСвоим > 0,Истина,Ложь));
	Остаток = Запрос.Выполнить().Выбрать();
	
	Пока Остаток.Следующий() Цикл
		Если Остаток.КоличествоОстаток < 0 Тогда
			Отказ = Истина;
			Текст = "Нет квот на добычу " + ВидДичи;
			Поле = "Объект.ВидДичи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,ЭтотОбъект,Поле,"ЭтотОбъект");
		КонецЕсли;
	КонецЦикла;
	
	Движения.ДобытаяДичь.Записывать = Истина;
	Движения.ДобытаяДичь.Очистить();
	Движения.ДобытаяДичь.Загрузить(Пакет[1].Выгрузить());
	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Охотники") Тогда
		Охотхозяйство = ДанныеЗаполнения.Охотхозяйство;
		МестоОхоты = ДанныеЗаполнения.Охотхозяйство;
		Охотник = ДанныеЗаполнения.Ссылка;
		СезонОхоты = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Путевка = ОхотаСервер.НайтиПодчиненнуюПутевку(Ссылка);
	//Если НЕ Путевка.Пустая() И Путевка.Проведен Тогда
	//	Отказ = Истина;
	//	Текст = "Нельзя отменять проведение документа.
	//			|Есть подчиненный проведенный документ";
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ТекстЭтотОбъект");
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Путевка = ОхотаСервер.НайтиПодчиненнуюПутевку(Ссылка);
	Если НЕ Путевка.Пустая() Тогда	
		Попытка
			ПутевкаОбъект = Путевка.ПолучитьОбъект();
			ПутевкаОбъект.Удалить();
		Исключение
			Отказ = Истина;
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.СформироватьТекстСообщения(ОписаниеОшибки());
			ЗаписьЖурналаРегистрации("Данные.Удаление",УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект.Метаданные(),ЭтотОбъект.Ссылка,ТекстОшибки);
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ БезПроверки Тогда
		ПроверяемыеРеквизиты.Добавить("СезонОхоты");
		ПроверяемыеРеквизиты.Добавить("Охотхозяйство");
		ПроверяемыеРеквизиты.Добавить("МестоОхоты");
		ПроверяемыеРеквизиты.Добавить("ВидДичи");
		ПроверяемыеРеквизиты.Добавить("Охотник");
		ПроверяемыеРеквизиты.Добавить("ДатаНачала");
		ПроверяемыеРеквизиты.Добавить("ДатаОкончания");
		ПроверяемыеРеквизиты.Добавить("СерияРазрешения");
		ПроверяемыеРеквизиты.Добавить("НомерРазрешения");
		ПроверяемыеРеквизиты.Добавить("Ответственный");
	Иначе
		СтруктураДанных = Константы.ОбязательныеРеквизитыРазрешенияДляЕгеря.Получить().Получить();
		Для каждого КлючИЗначение из СтруктураДанных Цикл
			Если КлючИЗначение.Значение Тогда
				ПроверяемыеРеквизиты.Добавить(КлючИЗначение.Ключ);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
		
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ Ссылка.Пустая() И ПутевкаДоговор.Пустая() Тогда
		ПутевкаДоговор = ОхотаСервер.НайтиПодчиненнуюПутевку(Ссылка);
	КонецЕсли;	
КонецПроцедуры

