
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если НЕ ЭтотОбъект.ОтчетПоВидам Тогда
		Если ЭтотОбъект.ФорматДичи и ЭтотОбъект.СводныйОтчет Тогда
			ИмяГруппировки = "ТО";
		ИначеЕсли  НЕ ЭтотОбъект.ФорматДичи и ЭтотОбъект.СводныйОтчет Тогда
			ИмяГруппировки = "ДО";
		ИначеЕсли НЕ ЭтотОбъект.СводныйОтчет	и ЭтотОбъект.ФорматДичи Тогда
			 ИмяГруппировки = "ТП";
		Иначе
			 ИмяГруппировки = "ДП";
		КонецЕсли;	
	Иначе ИмяГруппировки = "ОПВ";
	КонецЕсли;
	
	Для Каждого ГруппировкаСКД Из КомпоновщикНастроек.Настройки.Структура Цикл
			ГруппировкаСКД.Использование = ?(ГруппировкаСКД.Имя = ИмяГруппировки, Истина, Ложь);
	КонецЦикла;
	
	Охотхозяйство = ЭтотОбъект.ОсновнаяОрганизация;
	Если НЕ Охотхозяйство.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОхотхозяйствоПользователя",Охотхозяйство);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОхотхозяйствоПользователя")).Использование =Ложь;
	КонецЕсли;	
	
	МестоОхоты = ЭтотОбъект.МестоОхоты;
	Если НЕ МестоОхоты.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МестоОхоты",МестоОхоты);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МестоОхоты")).Использование =Ложь;
	КонецЕсли;	
	
	
	ВидДичи = ЭтотОбъект.ВидДичи;
	Если НЕ ВидДичи.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидДичи",ВидДичи);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидДичи")).Использование =Ложь;
	КонецЕсли;	
	

	      
	ПериодОтчета = ЭтотОбъект.ПериодОтчета;
	Если ЗначениеЗаполнено(ПериодОтчета) Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",ПериодОтчета);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Использование =Ложь;
	КонецЕсли;	
	
	ОхотаСервер.ЗаполнитьЗаголовокОтчета(ЭтотОбъект);
	
КонецПроцедуры
