
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДнейОжиданияВозвратаРазрешения", Константы.ДнейОжиданияВозвратаРазрешения.Получить());
	УстановитьПривилегированныйРежим(Ложь);	

	
	ОтчетнаяДата = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОтчетнаяДата");
	
	Если ОтчетнаяДата.Значение = '00010101' Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтчетнаяДата",КонецДня(ТекущаяДата()));
	КонецЕсли;
	
	Если НЕ ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава() Тогда
		
		ОсновнаяОрганизация = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация"));
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Охотхозяйство",ОсновнаяОрганизация);
			
	Иначе
		ОсновнаяОрганизация = ЭтотОбъект.Охотхозяйство;
		Если Не ОсновнаяОрганизация.Пустая() Тогда
			КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Охотхозяйство",ОсновнаяОрганизация);
		Иначе
			КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Охотхозяйство").Использование = Ложь;
		КонецЕсли;	
		
	КонецЕсли;	

КонецПроцедуры
