
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СезонЗакрыт.Доступность = Ложь;
	Элементы.ДатаНачала.ТолькоПросмотр = Объект.СезонЗакрыт;
	Элементы.ДатаОкончания.ТолькоПросмотр = Объект.СезонЗакрыт;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект",Тип("СправочникОбъект.СезоныОхоты"));
	Если НЕ ОхотаСервер.ИзменитьСезон(ОбъектЗначение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Записать не удалось");
	КонецЕсли;	
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	ОповеститьОбИзменении(Объект.Ссылка);	
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

